<?php
$categories = array (
  0 => 'люстры',
  1 => 'подвесныесветильники',
  2 => 'потолочныесветильники',
  3 => 'настенныесветильникиибра',
  4 => 'настольныелампыиночники',
  5 => 'точечныесветильники',
  6 => 'споты',
  7 => 'торшеры',
  8 => 'трековыесистемы',
  9 => 'магнитныетрековыесистемы',
  10 => 'подсветки',
  11 => 'специализированныесветильники',
  12 => 'уличноеосвещение',
  13 => 'офисноеосвещение',
  14 => 'праздничноеосвещение',
  15 => 'аксессуары',
  16 => 'лампы',
  17 => 'светодиодныелентыикомплектующие',
  18 => 'электроустановочныеизделия',
  19 => 'декор',
  20 => 'мебель',
  'люстры' => 0,
  'подвесныесветильники' => 1,
  'потолочныесветильники' => 2,
  'настенныесветильникиибра' => 3,
  'настольныелампыиночники' => 4,
  'точечныесветильники' => 5,
  'споты' => 6,
  'торшеры' => 7,
  'трековыесистемы' => 8,
  'магнитныетрековыесистемы' => 9,
  'подсветки' => 10,
  'специализированныесветильники' => 11,
  'уличноеосвещение' => 12,
  'офисноеосвещение' => 13,
  'праздничноеосвещение' => 14,
  'аксессуары' => 15,
  'лампы' => 16,
  'светодиодныелентыикомплектующие' => 17,
  'электроустановочныеизделия' => 18,
  'декор' => 19,
  'мебель' => 20,
) ;
$subCategories = array (
  0 => '',
  1 => 'потолочныелюстры',
  2 => 'подвесныелюстры',
  3 => 'люстрынаштанге',
  4 => 'настенныесветильники',
  5 => 'настеннопотолочныесветильники',
  6 => 'брасоднимплафоном',
  7 => 'брасдвумяплафонами',
  8 => 'брастремяиболееплафонами',
  9 => 'декоративныенастольныелампы',
  10 => 'офисныенастольныелампы',
  11 => 'кабинетныенастольныелампы',
  12 => 'ночники',
  13 => 'точечныевстраиваемыесветильники',
  14 => 'точечныенакладныесветильники',
  15 => 'точечныеподвесныесветильники',
  16 => 'спотысоднимплафоном',
  17 => 'спотысдвумяплафонами',
  18 => 'спотыстремяиболееплафонами',
  19 => 'торшерысоднимплафоном',
  20 => 'торшерысдвумяиболееплафонами',
  21 => 'трековыесветильники',
  22 => 'шинопроводы',
  23 => 'готовыетрековыесистемы',
  24 => 'комплектующиедлятрековыхсистем',
  25 => 'магнитныетрековыесветильники',
  26 => 'магнитныешинопроводы',
  27 => 'подсветкидлякартин',
  28 => 'подсветкидлязеркал',
  29 => 'подсветкидлялестниц',
  30 => 'декоративныеподсветки',
  31 => 'мебельныесветильники',
  32 => 'светильникидлярастений',
  33 => 'бактерицидныесветильники',
  34 => 'светильникислупой',
  35 => 'кольцевыелампы',
  36 => 'соляныелампы',
  37 => 'фасадныесветильники',
  38 => 'ландшафтныесветильники',
  39 => 'парковыесветильники',
  40 => 'консольныесветильники',
  41 => 'уличныенастенныесветильники',
  42 => 'уличныепотолочныесветильники',
  43 => 'уличныеподвесныесветильники',
  44 => 'грунтовыесветильники',
  45 => 'газонныесветильники',
  46 => 'тротуарныесветильники',
  47 => 'подводныесветильники',
  48 => 'прожекторы',
  49 => 'фонарики',
  50 => 'даунлайты',
  51 => 'линейныесветильники',
  52 => 'модульныесветильники',
  53 => 'карданныесветильники',
  54 => 'светодиодныепанели',
  55 => 'светильникигрильято',
  56 => 'светильникиармстронг',
  57 => 'гирлянды',
  58 => 'новогодниеподвесы',
  59 => 'белтлайт',
  60 => 'дюралайт',
  61 => 'световыефигуры',
  62 => 'светодиодныедеревья',
  63 => 'интерьерныеукрашения',
  64 => 'проекторы',
  65 => 'дискошары',
  66 => 'свечи',
  67 => 'аксессуарыдлялюстр',
  68 => 'аксессуарыдляподвесныхипотолочныхсветильников',
  69 => 'аксессуарыдлябра',
  70 => 'аксессуарыдляточечныхсветильников',
  71 => 'аксессуарыдляспотов',
  72 => 'аксессуарыдляторшеров',
  73 => 'светодиодныелампы',
  74 => 'галогенныелампы',
  75 => 'лампынакаливания',
  76 => 'светодиодныеленты',
  77 => 'управлениесветодиоднымилентами',
  78 => 'блокипитания',
  79 => 'профилидлялент',
  80 => 'комплектующиедлялент',
  81 => 'комплектующиедляпрофилей',
  82 => 'готовыекомплекты',
  83 => 'розетки',
  84 => 'выключателипереключатели',
  85 => 'рамки',
  86 => 'лицевыепанелизаглушки',
  87 => 'управлениесветом',
  88 => 'терморегуляторы',
  89 => 'датчикидвижения',
  90 => 'реле',
  91 => 'таймеры',
  92 => 'звонки',
  93 => 'удлинителисетевыефильтры',
  94 => 'кабели',
  95 => 'патроны',
  96 => 'разветвители',
  97 => 'распаячныекоробки',
  98 => 'клеммы',
  99 => 'зеркала',
  100 => 'картины',
  101 => 'часы',
  102 => 'постеры',
  103 => 'декоративныепанно',
  104 => 'камины',
  105 => 'ключницы',
  106 => 'столы',
  107 => 'стулья',
  108 => 'мягкаямебель',
  109 => 'стеллажи',
  110 => 'комодытумбы',
  '' => 0,
  'потолочныелюстры' => 1,
  'подвесныелюстры' => 2,
  'люстрынаштанге' => 3,
  'настенныесветильники' => 4,
  'настеннопотолочныесветильники' => 5,
  'брасоднимплафоном' => 6,
  'брасдвумяплафонами' => 7,
  'брастремяиболееплафонами' => 8,
  'декоративныенастольныелампы' => 9,
  'офисныенастольныелампы' => 10,
  'кабинетныенастольныелампы' => 11,
  'ночники' => 12,
  'точечныевстраиваемыесветильники' => 13,
  'точечныенакладныесветильники' => 14,
  'точечныеподвесныесветильники' => 15,
  'спотысоднимплафоном' => 16,
  'спотысдвумяплафонами' => 17,
  'спотыстремяиболееплафонами' => 18,
  'торшерысоднимплафоном' => 19,
  'торшерысдвумяиболееплафонами' => 20,
  'трековыесветильники' => 21,
  'шинопроводы' => 22,
  'готовыетрековыесистемы' => 23,
  'комплектующиедлятрековыхсистем' => 24,
  'магнитныетрековыесветильники' => 25,
  'магнитныешинопроводы' => 26,
  'подсветкидлякартин' => 27,
  'подсветкидлязеркал' => 28,
  'подсветкидлялестниц' => 29,
  'декоративныеподсветки' => 30,
  'мебельныесветильники' => 31,
  'светильникидлярастений' => 32,
  'бактерицидныесветильники' => 33,
  'светильникислупой' => 34,
  'кольцевыелампы' => 35,
  'соляныелампы' => 36,
  'фасадныесветильники' => 37,
  'ландшафтныесветильники' => 38,
  'парковыесветильники' => 39,
  'консольныесветильники' => 40,
  'уличныенастенныесветильники' => 41,
  'уличныепотолочныесветильники' => 42,
  'уличныеподвесныесветильники' => 43,
  'грунтовыесветильники' => 44,
  'газонныесветильники' => 45,
  'тротуарныесветильники' => 46,
  'подводныесветильники' => 47,
  'прожекторы' => 48,
  'фонарики' => 49,
  'даунлайты' => 50,
  'линейныесветильники' => 51,
  'модульныесветильники' => 52,
  'карданныесветильники' => 53,
  'светодиодныепанели' => 54,
  'светильникигрильято' => 55,
  'светильникиармстронг' => 56,
  'гирлянды' => 57,
  'новогодниеподвесы' => 58,
  'белтлайт' => 59,
  'дюралайт' => 60,
  'световыефигуры' => 61,
  'светодиодныедеревья' => 62,
  'интерьерныеукрашения' => 63,
  'проекторы' => 64,
  'дискошары' => 65,
  'свечи' => 66,
  'аксессуарыдлялюстр' => 67,
  'аксессуарыдляподвесныхипотолочныхсветильников' => 68,
  'аксессуарыдлябра' => 69,
  'аксессуарыдляточечныхсветильников' => 70,
  'аксессуарыдляспотов' => 71,
  'аксессуарыдляторшеров' => 72,
  'светодиодныелампы' => 73,
  'галогенныелампы' => 74,
  'лампынакаливания' => 75,
  'светодиодныеленты' => 76,
  'управлениесветодиоднымилентами' => 77,
  'блокипитания' => 78,
  'профилидлялент' => 79,
  'комплектующиедлялент' => 80,
  'комплектующиедляпрофилей' => 81,
  'готовыекомплекты' => 82,
  'розетки' => 83,
  'выключателипереключатели' => 84,
  'рамки' => 85,
  'лицевыепанелизаглушки' => 86,
  'управлениесветом' => 87,
  'терморегуляторы' => 88,
  'датчикидвижения' => 89,
  'реле' => 90,
  'таймеры' => 91,
  'звонки' => 92,
  'удлинителисетевыефильтры' => 93,
  'кабели' => 94,
  'патроны' => 95,
  'разветвители' => 96,
  'распаячныекоробки' => 97,
  'клеммы' => 98,
  'зеркала' => 99,
  'картины' => 100,
  'часы' => 101,
  'постеры' => 102,
  'декоративныепанно' => 103,
  'камины' => 104,
  'ключницы' => 105,
  'столы' => 106,
  'стулья' => 107,
  'мягкаямебель' => 108,
  'стеллажи' => 109,
  'комодытумбы' => 110,
) ;
$whiteList = array (
  0 => 
  array (
    0 => 0,
    1 => 1,
    2 => 2,
    3 => 3,
  ),
  1 => 
  array (
    0 => 0,
  ),
  2 => 
  array (
    0 => 0,
  ),
  3 => 
  array (
    0 => 0,
    1 => 4,
    2 => 5,
    3 => 6,
    4 => 7,
    5 => 8,
  ),
  4 => 
  array (
    0 => 0,
    1 => 9,
    2 => 10,
    3 => 11,
    4 => 12,
  ),
  5 => 
  array (
    0 => 0,
    1 => 13,
    2 => 14,
    3 => 15,
  ),
  6 => 
  array (
    0 => 0,
    1 => 16,
    2 => 17,
    3 => 18,
  ),
  7 => 
  array (
    0 => 0,
    1 => 19,
    2 => 20,
  ),
  8 => 
  array (
    0 => 0,
    1 => 21,
    2 => 22,
    3 => 23,
    4 => 24,
  ),
  9 => 
  array (
    0 => 0,
    1 => 25,
    2 => 26,
    3 => 24,
  ),
  10 => 
  array (
    0 => 0,
    1 => 27,
    2 => 28,
    3 => 29,
    4 => 30,
    5 => 31,
  ),
  11 => 
  array (
    0 => 0,
    1 => 32,
    2 => 33,
    3 => 34,
    4 => 35,
    5 => 36,
  ),
  12 => 
  array (
    0 => 0,
    1 => 37,
    2 => 38,
    3 => 39,
    4 => 40,
    5 => 41,
    6 => 42,
    7 => 43,
    8 => 44,
    9 => 45,
    10 => 46,
    11 => 47,
    12 => 48,
    13 => 49,
  ),
  13 => 
  array (
    0 => 0,
    1 => 50,
    2 => 51,
    3 => 52,
    4 => 53,
    5 => 54,
    6 => 55,
    7 => 56,
  ),
  14 => 
  array (
    0 => 0,
    1 => 57,
    2 => 58,
    3 => 59,
    4 => 60,
    5 => 61,
    6 => 62,
    7 => 63,
    8 => 64,
    9 => 65,
    10 => 66,
  ),
  15 => 
  array (
    0 => 0,
    1 => 67,
    2 => 68,
    3 => 69,
    4 => 70,
    5 => 71,
    6 => 72,
  ),
  16 => 
  array (
    0 => 0,
    1 => 73,
    2 => 74,
    3 => 75,
  ),
  17 => 
  array (
    0 => 0,
    1 => 76,
    2 => 77,
    3 => 78,
    4 => 79,
    5 => 80,
    6 => 81,
    7 => 82,
  ),
  18 => 
  array (
    0 => 0,
    1 => 83,
    2 => 84,
    3 => 85,
    4 => 86,
    5 => 87,
    6 => 88,
    7 => 89,
    8 => 90,
    9 => 91,
    10 => 92,
    11 => 93,
    12 => 94,
    13 => 95,
    14 => 96,
    15 => 97,
    16 => 98,
  ),
  19 => 
  array (
    0 => 0,
    1 => 99,
    2 => 100,
    3 => 101,
    4 => 102,
    5 => 103,
    6 => 104,
    7 => 105,
  ),
  20 => 
  array (
    0 => 0,
    1 => 106,
    2 => 107,
    3 => 108,
    4 => 109,
    5 => 110,
  ),
) ;
$data = array (
  0 => 
  array (
    1 => 
    array (
      'template' => 'Потолочная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Потолочная люстра',
      'feature' => 
      array (
        0 => 'рожковые',
        1 => 'кольца',
        2 => 'каскадные',
        3 => 'молекулы',
        4 => 'хрустальные',
        5 => 'дизайнерские',
        6 => 'светодиодные',
        7 => 'барабан',
        8 => 'буше',
        9 => 'детские',
      ),
      'installType' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
    ),
    2 => 
    array (
      'template' => 'Подвесная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Подвесная люстра',
      'feature' => 
      array (
        0 => 'рожковые',
        1 => 'кольца',
        2 => 'каскадные',
        3 => 'пауки',
        4 => 'молекулы',
        5 => 'хрустальные',
        6 => 'дизайнерские',
        7 => 'светодиодные',
        8 => 'барабан',
        9 => 'детские',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    3 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => 'рожковые',
        1 => 'кольца',
        2 => 'каскадные',
        3 => 'молекулы',
        4 => 'хрустальные',
        5 => 'дизайнерские',
        6 => 'светодиодные',
        7 => 'барабан',
        8 => 'буше',
        9 => 'детские',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  1 => 
  array (
    0 => 
    array (
      'template' => 'Подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подвесной светильник',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'цилиндр',
        2 => 'купол',
        3 => 'клетки',
        4 => 'дизайнерские',
        5 => 'каскадные',
        6 => 'линейные',
        7 => 'детские',
      ),
      'installType' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
    ),
  ),
  2 => 
  array (
    0 => 
    array (
      'template' => 'Потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Потолочный светильник',
      'feature' => 
      array (
        0 => 'круглые',
        1 => 'квадратные',
        2 => 'фигурные',
        3 => 'дизайнерские',
        4 => 'детские',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  3 => 
  array (
    4 => 
    array (
      'template' => 'Настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    5 => 
    array (
      'template' => 'Настенно-потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    6 => 
    array (
      'template' => 'Бра {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'бра с одним плафоном',
        1 => 'бра с двумя и более плафонами',
        2 => 'бра на гибкой ножке',
        3 => 'бра с подсветкой',
        4 => 'бра с полкой',
        5 => 'детские',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    7 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    8 => 
    array (
      'template' => '',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  4 => 
  array (
    9 => 
    array (
      'template' => 'Декоративныая настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная настольная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
    ),
    10 => 
    array (
      'template' => 'Офисная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Офисная настольная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    11 => 
    array (
      'template' => 'Кабинетная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кабинетная настольная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    12 => 
    array (
      'template' => 'Ночник {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  5 => 
  array (
    13 => 
    array (
      'template' => 'Точечный встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный встраиваемый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    14 => 
    array (
      'template' => 'Точечный накладной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный накладной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    15 => 
    array (
      'template' => 'Точечный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный подвесной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  6 => 
  array (
    16 => 
    array (
      'template' => 'Спот с одним плафоном {$vendor} {$collection} {$article}',
      'singular' => 'Спот с одним плафоном',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    17 => 
    array (
      'template' => 'Спот с двумя плафонами {$vendor} {$collection} {$article}',
      'singular' => 'Спот с двумя плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    18 => 
    array (
      'template' => 'Спот с тремя и более плафонами {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  7 => 
  array (
    19 => 
    array (
      'template' => 'Торшер с одним плафоном {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с одним плафоном',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
    ),
    20 => 
    array (
      'template' => 'Торшер с двумя и более плафонами {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с двумя и более плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
    ),
  ),
  8 => 
  array (
    21 => 
    array (
      'template' => 'Трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Трековый светильник',
      'feature' => 
      array (
        0 => 'линейные',
        1 => 'панельные',
        2 => 'подвесные',
        3 => 'споты',
        4 => 'софиты',
      ),
      'installType' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
    ),
    22 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
    ),
    23 => 
    array (
      'template' => 'Готовая трековая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    24 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Особенность_web',
      'feature' => 
      array (
        0 => 'коннекторы',
        1 => 'соединители',
        2 => 'заглушки',
        3 => 'подвесные комплекты',
        4 => 'крепления',
        5 => 'подводы питания',
        6 => 'блоки питания',
        7 => 'адаптеры',
        8 => 'декоративные накладки',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  9 => 
  array (
    25 => 
    array (
      'template' => 'Магнитный трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Магнитный трековый светильник',
      'feature' => 
      array (
        0 => 'линейные',
        1 => 'панельные',
        2 => 'подвесные',
        3 => 'споты',
        4 => 'софиты',
      ),
      'installType' => 
      array (
        0 => 'магнитные',
      ),
    ),
    26 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'магнитные',
      ),
    ),
    24 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Особенность_web',
      'feature' => 
      array (
        0 => 'коннекторы',
        1 => 'соединители',
        2 => 'заглушки',
        3 => 'подвесные комплекты',
        4 => 'крепления',
        5 => 'подводы питания',
        6 => 'блоки питания',
        7 => 'адаптеры',
        8 => 'декоративные накладки',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  10 => 
  array (
    27 => 
    array (
      'template' => 'Подсветка для картин {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для картин',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    28 => 
    array (
      'template' => 'Подсветка для зеркал {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для зеркал',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    29 => 
    array (
      'template' => 'Подсветка для лестниц {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для лестниц',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    30 => 
    array (
      'template' => 'Декоративная подсветка {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная подсветка',
      'feature' => 
      array (
        0 => 'с лучами',
        1 => 'с отраженным светом',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    31 => 
    array (
      'template' => 'Мебельный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Мебельный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  11 => 
  array (
    32 => 
    array (
      'template' => 'Светильник для растений {$vendor} {$collection} {$article}',
      'singular' => 'Светильник для растений',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    33 => 
    array (
      'template' => 'Бактерицидный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Бактерицидный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    34 => 
    array (
      'template' => 'Светильник с лупой {$vendor} {$collection} {$article}',
      'singular' => 'Светильник с лупой',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    35 => 
    array (
      'template' => 'Кольцевая лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кольцевая лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    36 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  12 => 
  array (
    37 => 
    array (
      'template' => 'Фасадный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Фасадный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    38 => 
    array (
      'template' => 'Ландшафтный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Ландшафтный светильник',
      'feature' => 
      array (
        0 => 'столбики',
        1 => 'шары',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    39 => 
    array (
      'template' => 'Парковый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Парковый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    40 => 
    array (
      'template' => 'Консольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Консольный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    41 => 
    array (
      'template' => 'Уличный настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    42 => 
    array (
      'template' => 'Уличный потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    43 => 
    array (
      'template' => 'Уличный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный подвесной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    44 => 
    array (
      'template' => 'Грунтовый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Грунтовый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    45 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Газонный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'на солнечных батарейках',
      ),
    ),
    46 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    47 => 
    array (
      'template' => 'Подводный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подводный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    48 => 
    array (
      'template' => 'Прожектор {$vendor} {$collection} {$article}',
      'singular' => 'Прожектор',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
    ),
    49 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Фонарик',
      'feature' => 
      array (
        0 => 'аварийные',
        1 => 'автомобильные',
        2 => 'велосипедные',
        3 => 'карманные',
        4 => 'кемпинговые',
        5 => 'налобные',
        6 => 'переносные',
        7 => 'противомоскитные',
        8 => 'ручные',
        9 => 'рабочие',
        10 => 'фонарь-брелок',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  13 => 
  array (
    50 => 
    array (
      'template' => 'Встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Даунлайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    51 => 
    array (
      'template' => 'Линейный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Линейный',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    52 => 
    array (
      'template' => 'Модульный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Модульный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    53 => 
    array (
      'template' => 'Карданный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Карданный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    54 => 
    array (
      'template' => 'Светодиодная панель {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная панель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    55 => 
    array (
      'template' => 'Светильник грильято {$vendor} {$collection} {$article}',
      'singular' => 'Светильник грильято',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    56 => 
    array (
      'template' => 'Светильник армстронг {$vendor} {$collection} {$article}',
      'singular' => 'Светильник армстронг',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  14 => 
  array (
    57 => 
    array (
      'template' => 'Гирлянда {$vendor} {$collection} {$article}',
      'singular' => 'Гирлянда',
      'feature' => 
      array (
        0 => 'нить',
        1 => 'занавес',
        2 => 'бахрома',
        3 => 'сеть',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    58 => 
    array (
      'template' => 'Новогодний подвес {$vendor} {$collection} {$article}',
      'singular' => 'Новогодний подвес',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    59 => 
    array (
      'template' => 'Белт-лайт {$vendor} {$collection} {$article}',
      'singular' => 'Белт-лайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    60 => 
    array (
      'template' => 'Дюралайт {$vendor} {$collection} {$article}',
      'singular' => 'Дюралайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    61 => 
    array (
      'template' => 'Световая фигура {$vendor} {$collection} {$article}',
      'singular' => 'Световая фигура',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    62 => 
    array (
      'template' => 'Светодиодное дерево {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодное дерево',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    63 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Особенность_web',
      'feature' => 
      array (
        0 => '.....',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    64 => 
    array (
      'template' => 'Проектор {$vendor} {$collection} {$article}',
      'singular' => 'Проектор',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    65 => 
    array (
      'template' => 'Диско-шар {$vendor} {$collection} {$article}',
      'singular' => 'Диско-шар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    66 => 
    array (
      'template' => 'Свеча {$vendor} {$collection} {$article}',
      'singular' => 'Свеча',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  15 => 
  array (
    67 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'плафоны',
        1 => 'абажуры',
        2 => 'пульты',
        3 => 'лифты',
        4 => 'крепления',
        5 => 'цепи',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    68 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'основания',
        1 => 'подвесные комплекты',
        2 => 'крепления',
        3 => 'цепи',
        4 => 'светодиодные модули',
        5 => 'рассеиватели',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    69 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'абажуры',
        1 => 'выключатели',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    70 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'кольца',
        1 => 'рамки',
        2 => 'отражатели',
        3 => 'рассеиватели',
        4 => 'линзы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    71 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'кольца',
        1 => 'отражатели',
        2 => 'рассеиватели',
        3 => 'шторки',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    72 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'абажуры',
        1 => 'выключатели',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  16 => 
  array (
    73 => 
    array (
      'template' => 'Светодиодная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная лампа',
      'feature' => 
      array (
        0 => 'филаментные лампы',
        1 => 'диммируемые',
        2 => 'декоративные',
        3 => 'ретро-лампы',
        4 => 'классические',
        5 => 'контурные',
        6 => 'специализированные',
      ),
      'installType' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
    ),
    74 => 
    array (
      'template' => 'Галогенная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Галогенная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    75 => 
    array (
      'template' => 'Лампа накаливания {$vendor} {$collection} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'ретро-лампы',
        1 => 'классические',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  17 => 
  array (
    76 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'универсальные (8-10 мм)',
        1 => 'узкие (3',
        2 => '5-5 мм)',
        3 => 'широкие (15-85 мм)',
        4 => 'мультицветные (RGB',
        5 => 'RGBW)',
        6 => 'гибкий неон',
        7 => 'лист',
        8 => 'линейка',
      ),
      'installType' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
    ),
    77 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'контроллеры',
        1 => 'усилители сигнала',
        2 => 'диммеры',
        3 => 'пульты',
        4 => 'панели управления',
        5 => 'аксессуары',
        6 => 'блок аварийного питания',
        7 => 'декодер (конвектор сигнала)',
        8 => 'беспроводной выключатель',
        9 => 'диммер с ИК-пультом',
        10 => 'роторная панель',
        11 => 'клавишная панель',
        12 => 'сенсорная панель',
        13 => 'релейный модуль',
        14 => 'контроллер лестничный',
        15 => 'контроллер-усилитель',
        16 => 'контроллер тока',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    78 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'аккумуляторная батарея',
        1 => 'драйвер',
        2 => 'источник напряжения',
        3 => 'источник тока',
        4 => 'блок питания шины',
      ),
      'installType' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
    ),
    79 => 
    array (
      'template' => 'Профиль для лент ',
      'singular' => 'Профиль для лент',
      'feature' => 
      array (
        0 => 'компактные',
        1 => 'широкие',
        2 => 'специализированные',
        3 => 'профиль-держатель',
        4 => 'соединитель',
        5 => 'соединитель фигурный',
        6 => 'соединитель угловой',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    80 => 
    array (
      'template' => 'Запчасть для лент',
      'singular' => 'Запчасть для лент',
      'feature' => 
      array (
        0 => 'коннекторы',
        1 => 'соединители',
        2 => 'заглушки',
        3 => 'крепления',
        4 => 'подводы питания/сетевые шнуры',
        5 => 'разветвлитель',
        6 => 'коробка распределительная',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    81 => 
    array (
      'template' => 'Запчасть для профилей',
      'singular' => 'Запчасть для профилей',
      'feature' => 
      array (
        0 => 'экраны',
        1 => 'заглушки',
        2 => 'крепежи',
        3 => 'соединители',
        4 => 'подвесы',
        5 => 'подвес токопроводящий',
        6 => 'подвес с держателем',
        7 => 'вставка',
        8 => 'зажим',
        9 => 'кресовина',
        10 => 'кронштейн',
        11 => 'тройник',
        12 => 'соединитель угловой',
        13 => 'соединитель прямой',
        14 => 'соединитель фигурный',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    82 => 
    array (
      'template' => 'Готовый комплект ',
      'singular' => 'Готовый комплект',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  18 => 
  array (
    83 => 
    array (
      'template' => 'Розетка {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'электрические',
        1 => 'TV',
        2 => 'интернет RJ-45',
        3 => 'телефонные RJ-11',
        4 => 'HDMI',
        5 => 'USB',
        6 => 'видео',
        7 => 'аудио',
        8 => 'акустические',
        9 => 'вывод для кабеля',
      ),
      'installType' => 
      array (
        0 => 'со шторками',
        1 => 'с крышкой',
      ),
    ),
    0 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    84 => 
    array (
      'template' => 'Коммутатор {$article}',
      'singular' => 'Коммутатор',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные',
        2 => 'кнопочные',
        3 => 'веревочные',
        4 => 'повортные',
        5 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'одноклавишные',
        1 => 'двухклавишные',
        2 => 'трехклавишные',
      ),
    ),
    85 => 
    array (
      'template' => 'Рамка {$article}',
      'singular' => 'Рамка',
      'feature' => 
      array (
        0 => 'однопостовые',
        1 => 'двупостовые',
        2 => 'трехпостовые',
        3 => 'четырехпостовые',
        4 => 'пятипостовые',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    86 => 
    array (
      'template' => 'Панель {$article}',
      'singular' => 'Панель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    87 => 
    array (
      'template' => '{$osobennost} {$article}, ',
      'singular' => 'Светорегулятор',
      'feature' => 
      array (
        0 => 'диммер (светорегулятор)',
        1 => 'усилитель',
        2 => 'контроллер',
        3 => 'конвертор',
        4 => 'декодер',
        5 => 'панель управления (в т.ч. роторная панель)',
        6 => 'ВСЕ товары у которых в профессиональной аббревиатуре есть KNX',
        7 => 'DALI',
        8 => 'DMX',
      ),
      'installType' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
    ),
    88 => 
    array (
      'template' => 'Терморегулятор {$article}',
      'singular' => 'Терморегулятор',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    89 => 
    array (
      'template' => 'Датчик движения {$article}',
      'singular' => 'Датчик движения',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    90 => 
    array (
      'template' => 'Реле wifi {$article}',
      'singular' => 'Реле wifi',
      'feature' => 
      array (
        0 => 'реле wi-fi',
        1 => 'релейный модуль',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    91 => 
    array (
      'template' => 'Таймер {$article}',
      'singular' => 'Таймер',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    92 => 
    array (
      'template' => 'Звонок {$article}',
      'singular' => 'Звонок',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    93 => 
    array (
      'template' => 'Розетка {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    94 => 
    array (
      'template' => 'Кабель {$article}',
      'singular' => 'Кабель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    95 => 
    array (
      'template' => 'Патрон {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    96 => 
    array (
      'template' => 'Разветвитель {$article}',
      'singular' => 'Разветвитель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    97 => 
    array (
      'template' => 'Распаячная коробка {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    98 => 
    array (
      'template' => 'Клемма {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  19 => 
  array (
    99 => 
    array (
      'template' => 'Зеркало {$article}',
      'singular' => 'Зеркало',
      'feature' => 
      array (
        0 => 'зеркальные панно',
        1 => 'зеркала с фацетом',
        2 => 'в раме',
        3 => 'без рамы',
        4 => 'зеркала с подсветкой',
        5 => 'гримерные зеркала',
        6 => 'зеркала для ванных комнат',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    100 => 
    array (
      'template' => 'Картина {$article}',
      'singular' => 'Картина',
      'feature' => 
      array (
        0 => 'на холстах',
        1 => 'модульные',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    101 => 
    array (
      'template' => 'Часы {$vendor} {$collection} {$article}',
      'singular' => 'Часы',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    102 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    103 => 
    array (
      'template' => 'Декоративное панно {$vendor} {$collection} {$article}',
      'singular' => 'Декоративное панно',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    104 => 
    array (
      'template' => 'Камин {$vendor} {$collection} {$article}',
      'singular' => 'Камин',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    105 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Ключница',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  20 => 
  array (
    106 => 
    array (
      'template' => 'Стол {$article}',
      'singular' => 'Стол',
      'feature' => 
      array (
        0 => 'банкетные',
        1 => 'барные',
        2 => 'журнальные',
        3 => 'компьютерные',
        4 => 'кухонные',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    107 => 
    array (
      'template' => 'Стул {$article}',
      'singular' => 'Стул',
      'feature' => 
      array (
        0 => 'барные',
        1 => 'обеденные',
        2 => 'табуреты',
        3 => 'лавки',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    108 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Особенность_web',
      'feature' => 
      array (
        0 => 'банкетки',
        1 => 'диваны',
        2 => 'пуфы',
        3 => 'кресла',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    109 => 
    array (
      'template' => 'Стеллаж {$vendor} {$collection} {$article}',
      'singular' => 'Стеллаж',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    110 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Особенность_web',
      'feature' => 
      array (
        0 => 'комоды',
        1 => 'тумбы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    0 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
) ;
$Ca = array (
  0 => 'Люстры',
  1 => 'Подвесные светильники',
  2 => 'Потолочные светильники',
  3 => 'Настенные светильники и бра',
  4 => 'Настольные лампы и ночники',
  5 => 'Точечные светильники',
  6 => 'Споты',
  7 => 'Торшеры',
  8 => 'Трековые системы',
  9 => 'Магнитные трековые системы',
  10 => 'Подсветки',
  11 => 'Специализированные светильники',
  12 => 'Уличное освещение',
  13 => 'Офисное освещение',
  14 => 'Праздничное освещение',
  15 => 'Аксессуары',
  16 => 'Лампы',
  17 => 'Светодиодные ленты и комплектующие',
  18 => 'Электроустановочные изделия',
  19 => 'Декор ',
  20 => 'Мебель',
) ;
$SubCa = array (
  1 => 'Потолочные люстры',
  2 => 'Подвесные люстры',
  3 => 'Люстры на штанге',
  0 => NULL,
  4 => 'Настенные светильники',
  5 => 'Настенно-потолочные светильники',
  6 => 'Бра с одним плафоном',
  7 => 'Бра с двумя плафонами',
  8 => 'Бра с тремя и более плафонами',
  9 => 'Декоративные настольные лампы',
  10 => 'Офисные настольные лампы',
  11 => 'Кабинетные настольные лампы',
  12 => 'Ночники',
  13 => 'Точечные встраиваемые светильники',
  14 => 'Точечные накладные светильники',
  15 => 'Точечные подвесные светильники',
  16 => 'Споты с одним плафоном',
  17 => 'Споты с двумя плафонами',
  18 => 'Споты с тремя и более плафонами',
  19 => 'Торшеры с одним плафоном',
  20 => 'Торшеры с двумя и более плафонами',
  21 => 'Трековые светильники',
  22 => 'Шинопроводы',
  23 => 'Готовые трековые системы',
  24 => 'Комплектующие для трековых систем',
  25 => 'Магнитные трековые светильники',
  26 => 'Магнитные шинопроводы',
  27 => 'Подсветки для картин',
  28 => 'Подсветки для зеркал',
  29 => 'Подсветки для лестниц',
  30 => 'Декоративные подсветки',
  31 => 'Мебельные светильники',
  32 => 'Светильники для растений',
  33 => 'Бактерицидные светильники',
  34 => 'Светильники с лупой',
  35 => 'Кольцевые лампы',
  36 => 'Соляные лампы',
  37 => 'Фасадные светильники',
  38 => 'Ландшафтные светильники',
  39 => 'Парковые светильники',
  40 => 'Консольные светильники',
  41 => 'Уличные настенные светильники',
  42 => 'Уличные потолочные светильники',
  43 => 'Уличные подвесные светильники',
  44 => 'Грунтовые светильники',
  45 => 'Газонные светильники',
  46 => 'Тротуарные светильники',
  47 => 'Подводные светильники',
  48 => 'Прожекторы',
  49 => 'Фонарики',
  50 => 'Даунлайты',
  51 => 'Линейные светильники',
  52 => 'Модульные светильники',
  53 => 'Карданные светильники',
  54 => 'Светодиодные панели',
  55 => 'Светильники грильято',
  56 => 'Светильники армстронг',
  57 => 'Гирлянды',
  58 => 'Новогодние подвесы',
  59 => 'Белт-лайт',
  60 => 'Дюралайт',
  61 => 'Световые фигуры',
  62 => 'Светодиодные деревья ',
  63 => 'Интерьерные украшения',
  64 => 'Проекторы',
  65 => 'Диско-шары',
  66 => 'Свечи',
  67 => 'Аксессуары для люстр',
  68 => 'Аксессуары для подвесных и потолочных светильников',
  69 => 'Аксессуары для бра',
  70 => 'Аксессуары для точечных светильников',
  71 => 'Аксессуары для спотов',
  72 => 'Аксессуары для торшеров',
  73 => 'Светодиодные лампы',
  74 => 'Галогенные лампы',
  75 => 'Лампы накаливания',
  76 => 'Светодиодные ленты',
  77 => 'Управление светодиодными лентами',
  78 => 'Блоки питания',
  79 => 'Профили для лент',
  80 => 'Комплектующие для лент',
  81 => 'Комплектующие для профилей',
  82 => 'Готовые комплекты',
  83 => 'Розетки',
  84 => 'Выключатели, переключатели',
  85 => 'Рамки',
  86 => 'Лицевые панели, заглушки',
  87 => 'Управление светом ',
  88 => 'Терморегуляторы',
  89 => 'Датчики движения',
  90 => 'Реле',
  91 => 'Таймеры',
  92 => 'Звонки',
  93 => 'Удлинители, сетевые фильтры',
  94 => 'Кабели',
  95 => 'Патроны',
  96 => 'Разветвители',
  97 => 'Распаячные коробки',
  98 => 'Клеммы',
  99 => 'Зеркала',
  100 => 'Картины',
  101 => 'Часы',
  102 => 'Постеры',
  103 => 'Декоративные панно',
  104 => 'Камины',
  105 => 'Ключницы',
  106 => 'Столы',
  107 => 'Стулья',
  108 => 'Мягкая мебель',
  109 => 'Стеллажи',
  110 => 'Комоды, тумбы',
) ;
return [
'categories'=> $categories,
'subCategories'=> $subCategories,
'whiteList'=> $whiteList,
'data'=> $data,
'originalsCategories'=> $Ca,
'originalsSubCategories'=> $SubCa,
];