<?php
$categories = array (
  0 => 'люстры',
  5 => 'подвесныесветильники',
  6 => 'потолочныесветильники',
  7 => 'настенныесветильникиибра',
  12 => 'настольныелампыиночники',
  17 => 'точечныесветильники',
  20 => 'споты',
  23 => 'торшеры',
  25 => 'трековыесистемы',
  30 => 'магнитныетрековыесистемы',
  33 => 'подсветки',
  38 => 'специализированныесветильники',
  46 => 'уличноеосвещение',
  60 => 'офисноеосвещение',
  67 => 'праздничноеосвещение',
  77 => 'аксессуары',
  87 => 'лампы',
  92 => 'светодиодныелентыикомплектующие',
  99 => 'электроустановочныеизделия',
  118 => 'декор',
  129 => 'текстиль',
  132 => 'посуда',
  135 => 'мебель',
  'аксессуары' => 77,
  'декор' => 118,
  'лампы' => 87,
  'люстры' => 0,
  'магнитныетрековыесистемы' => 30,
  'мебель' => 135,
  'настенныесветильникиибра' => 7,
  'настольныелампыиночники' => 12,
  'офисноеосвещение' => 60,
  'подвесныесветильники' => 5,
  'подсветки' => 33,
  'посуда' => 132,
  'потолочныесветильники' => 6,
  'праздничноеосвещение' => 67,
  'светодиодныелентыикомплектующие' => 92,
  'специализированныесветильники' => 38,
  'споты' => 20,
  'текстиль' => 129,
  'торшеры' => 23,
  'точечныесветильники' => 17,
  'трековыесистемы' => 25,
  'уличноеосвещение' => 46,
  'электроустановочныеизделия' => 99,
) ;
$subCategories = array (
  '' => 0,
  0 => '',
  1 => 'потолочныелюстры',
  2 => 'подвесныелюстры',
  3 => 'люстрынаштанге',
  4 => 'люстрывентиляторы',
  5 => 'каскадныелюстры',
  8 => 'настенныесветильники',
  9 => 'настеннопотолочныесветильники',
  10 => 'бра',
  13 => 'декоративныенастольныелампы',
  14 => 'офисныенастольныелампы',
  15 => 'кабинетныенастольныелампы',
  16 => 'ночники',
  17 => 'детскиенастольныелампы',
  18 => 'точечныевстраиваемыесветильники',
  19 => 'точечныенакладныесветильники',
  20 => 'точечныеподвесныесветильники',
  21 => 'спотысоднимплафоном',
  22 => 'спотысдвумяплафонами',
  23 => 'спотыстремяиболееплафонами',
  24 => 'торшерысоднимплафоном',
  25 => 'торшерысдвумяиболееплафонами',
  26 => 'трековыесветильники',
  27 => 'шинопроводы',
  28 => 'готовыетрековыесистемы',
  29 => 'тросовыесистемы',
  30 => 'комплектующиедлятрековыхсистем',
  31 => 'магнитныетрековыесветильники',
  32 => 'магнитныешинопроводы',
  33 => 'комплектующиедлямагнитныхтреков',
  34 => 'подсветкидлякартин',
  35 => 'подсветкидлязеркал',
  36 => 'подсветкидлялестниц',
  37 => 'декоративныеподсветки',
  38 => 'мебельныесветильники',
  39 => 'светильникидлярастений',
  40 => 'бактерицидныесветильники',
  41 => 'светильникислупой',
  42 => 'кольцевыелампы',
  43 => 'соляныелампы',
  44 => 'промышленныесветильники',
  45 => 'светильникидлябаньисаун',
  46 => 'аварийныесветильники',
  47 => 'фасадныесветильники',
  48 => 'ландшафтныесветильники',
  49 => 'парковыесветильники',
  50 => 'консольныесветильники',
  51 => 'уличныенастенныесветильники',
  52 => 'уличныенастольныесветильники',
  53 => 'уличныепотолочныесветильники',
  54 => 'уличныеподвесныесветильники',
  55 => 'грунтовыесветильники',
  56 => 'газонныесветильники',
  57 => 'тротуарныесветильники',
  58 => 'подводныесветильники',
  59 => 'прожекторы',
  60 => 'фонарики',
  61 => 'даунлайты',
  62 => 'линейныесветильники',
  63 => 'модульныесветильники',
  64 => 'карданныесветильники',
  65 => 'светодиодныепанели',
  66 => 'светильникигрильято',
  67 => 'светильникиармстронг',
  68 => 'гирлянды',
  69 => 'новогодниеподвесы',
  70 => 'белтлайт',
  71 => 'дюралайт',
  72 => 'светодиодныефигуры',
  73 => 'светодиодныедеревья',
  74 => 'интерьерныеукрашения',
  75 => 'проекторы',
  76 => 'дискошары',
  77 => 'светодиодныесвечииподсвечники',
  78 => 'аксессуарыдлялюстр',
  79 => 'аксессуарыдляподвесныхипотолочныхсветильников',
  80 => 'аксессуарыдлябра',
  81 => 'аксессуарыдлянастольныхламп',
  82 => 'аксессуарыдляточечныхсветильников',
  83 => 'аксессуарыдляспотов',
  84 => 'аксессуарыдляуличныхсветильников',
  85 => 'аксессуарыдляспециализированныхсветильников',
  86 => 'средствадляочистки',
  87 => 'аксессуарыдляторшеров',
  88 => 'светодиодныелампы',
  89 => 'галогенныелампы',
  90 => 'лампынакаливания',
  91 => 'энергосберегающиелампы',
  92 => 'специализированныелампы',
  93 => 'светодиодныеленты',
  94 => 'управлениесветодиоднымилентами',
  95 => 'блокипитания',
  96 => 'профилидлялент',
  97 => 'комплектующиедлялент',
  98 => 'комплектующиедляпрофилей',
  99 => 'готовыекомплекты',
  100 => 'розетки',
  102 => 'выключателипереключатели',
  103 => 'рамкиисуппорты',
  104 => 'лицевыепанелиизаглушки',
  105 => 'управлениесветом',
  106 => 'терморегуляторы',
  107 => 'датчикидвижения',
  108 => 'реле',
  109 => 'таймеры',
  110 => 'звонки',
  111 => 'удлинителиисетевыефильтры',
  112 => 'кабелииизоляторы',
  113 => 'патроны',
  114 => 'оборудованиезащитыикоммутации',
  115 => 'разветвителиипереходники',
  116 => 'монтажныекоробки',
  117 => 'акустическиесистемы',
  118 => 'клеммы',
  119 => 'зеркала',
  120 => 'картины',
  121 => 'елочныеигрушки',
  122 => 'часы',
  123 => 'искусственныеелки',
  124 => 'уличныйдекор',
  125 => 'постеры',
  126 => 'цветы',
  127 => 'модульныекартины',
  128 => 'вазы',
  129 => 'ключницы',
  130 => 'подушки',
  131 => 'пледы',
  132 => 'ковры',
  133 => 'чаши',
  134 => 'блюда',
  135 => 'конфетницы',
  136 => 'столы',
  137 => 'стулья',
  138 => 'мягкаямебель',
  139 => 'стеллажи',
  140 => 'комодытумбы',
  'аварийныесветильники' => 46,
  'аксессуарыдлябра' => 80,
  'аксессуарыдлялюстр' => 78,
  'аксессуарыдлянастольныхламп' => 81,
  'аксессуарыдляподвесныхипотолочныхсветильников' => 79,
  'аксессуарыдляспециализированныхсветильников' => 85,
  'аксессуарыдляспотов' => 83,
  'аксессуарыдляторшеров' => 87,
  'аксессуарыдляточечныхсветильников' => 82,
  'аксессуарыдляуличныхсветильников' => 84,
  'акустическиесистемы' => 117,
  'бактерицидныесветильники' => 40,
  'белтлайт' => 70,
  'блокипитания' => 95,
  'блюда' => 134,
  'бра' => 10,
  'вазы' => 128,
  'выключателипереключатели' => 102,
  'газонныесветильники' => 56,
  'галогенныелампы' => 89,
  'гирлянды' => 68,
  'готовыекомплекты' => 99,
  'готовыетрековыесистемы' => 28,
  'грунтовыесветильники' => 55,
  'датчикидвижения' => 107,
  'даунлайты' => 61,
  'декоративныенастольныелампы' => 13,
  'декоративныеподсветки' => 37,
  'детскиенастольныелампы' => 17,
  'дискошары' => 76,
  'дюралайт' => 71,
  'елочныеигрушки' => 121,
  'звонки' => 110,
  'зеркала' => 119,
  'интерьерныеукрашения' => 74,
  'искусственныеелки' => 123,
  'кабелииизоляторы' => 112,
  'кабинетныенастольныелампы' => 15,
  'карданныесветильники' => 64,
  'картины' => 120,
  'каскадныелюстры' => 5,
  'клеммы' => 118,
  'ключницы' => 129,
  'ковры' => 132,
  'кольцевыелампы' => 42,
  'комодытумбы' => 140,
  'комплектующиедлялент' => 97,
  'комплектующиедлямагнитныхтреков' => 33,
  'комплектующиедляпрофилей' => 98,
  'комплектующиедлятрековыхсистем' => 30,
  'консольныесветильники' => 50,
  'конфетницы' => 135,
  'лампынакаливания' => 90,
  'ландшафтныесветильники' => 48,
  'линейныесветильники' => 62,
  'лицевыепанелиизаглушки' => 104,
  'люстрывентиляторы' => 4,
  'люстрынаштанге' => 3,
  'магнитныетрековыесветильники' => 31,
  'магнитныешинопроводы' => 32,
  'мебельныесветильники' => 38,
  'модульныекартины' => 127,
  'модульныесветильники' => 63,
  'монтажныекоробки' => 116,
  'мягкаямебель' => 138,
  'настеннопотолочныесветильники' => 9,
  'настенныесветильники' => 8,
  'новогодниеподвесы' => 69,
  'ночники' => 16,
  'оборудованиезащитыикоммутации' => 114,
  'офисныенастольныелампы' => 14,
  'парковыесветильники' => 49,
  'патроны' => 113,
  'пледы' => 131,
  'подвесныелюстры' => 2,
  'подводныесветильники' => 58,
  'подсветкидлязеркал' => 35,
  'подсветкидлякартин' => 34,
  'подсветкидлялестниц' => 36,
  'подушки' => 130,
  'постеры' => 125,
  'потолочныелюстры' => 1,
  'проекторы' => 75,
  'прожекторы' => 59,
  'промышленныесветильники' => 44,
  'профилидлялент' => 96,
  'разветвителиипереходники' => 115,
  'рамкиисуппорты' => 103,
  'реле' => 108,
  'розетки' => 100,
  'светильникиармстронг' => 67,
  'светильникигрильято' => 66,
  'светильникидлябаньисаун' => 45,
  'светильникидлярастений' => 39,
  'светильникислупой' => 41,
  'светодиодныедеревья' => 73,
  'светодиодныелампы' => 88,
  'светодиодныеленты' => 93,
  'светодиодныепанели' => 65,
  'светодиодныесвечииподсвечники' => 77,
  'светодиодныефигуры' => 72,
  'соляныелампы' => 43,
  'специализированныелампы' => 92,
  'спотысдвумяплафонами' => 22,
  'спотысоднимплафоном' => 21,
  'спотыстремяиболееплафонами' => 23,
  'средствадляочистки' => 86,
  'стеллажи' => 139,
  'столы' => 136,
  'стулья' => 137,
  'таймеры' => 109,
  'терморегуляторы' => 106,
  'торшерысдвумяиболееплафонами' => 25,
  'торшерысоднимплафоном' => 24,
  'точечныевстраиваемыесветильники' => 18,
  'точечныенакладныесветильники' => 19,
  'точечныеподвесныесветильники' => 20,
  'трековыесветильники' => 26,
  'тросовыесистемы' => 29,
  'тротуарныесветильники' => 57,
  'удлинителиисетевыефильтры' => 111,
  'уличныенастенныесветильники' => 51,
  'уличныенастольныесветильники' => 52,
  'уличныеподвесныесветильники' => 54,
  'уличныепотолочныесветильники' => 53,
  'уличныйдекор' => 124,
  'управлениесветодиоднымилентами' => 94,
  'управлениесветом' => 105,
  'фасадныесветильники' => 47,
  'фонарики' => 60,
  'цветы' => 126,
  'часы' => 122,
  'чаши' => 133,
  'шинопроводы' => 27,
  'энергосберегающиелампы' => 91,
) ;
$whiteList = array (
  0 => 
  array (
    0 => 0,
    1 => 1,
    2 => 2,
    3 => 3,
    4 => 4,
    5 => 5,
  ),
  5 => 
  array (
    0 => 0,
  ),
  6 => 
  array (
    0 => 0,
  ),
  7 => 
  array (
    0 => 0,
    1 => 8,
    2 => 9,
    3 => 10,
  ),
  12 => 
  array (
    0 => 0,
    1 => 13,
    2 => 14,
    3 => 15,
    4 => 16,
    5 => 17,
  ),
  17 => 
  array (
    0 => 0,
    1 => 18,
    2 => 19,
    3 => 20,
  ),
  20 => 
  array (
    0 => 0,
    1 => 21,
    2 => 22,
    3 => 23,
  ),
  23 => 
  array (
    0 => 0,
    1 => 24,
    2 => 25,
  ),
  25 => 
  array (
    0 => 0,
    1 => 26,
    2 => 27,
    3 => 28,
    4 => 29,
    5 => 30,
  ),
  30 => 
  array (
    0 => 0,
    1 => 31,
    2 => 32,
    3 => 33,
  ),
  33 => 
  array (
    0 => 0,
    1 => 34,
    2 => 35,
    3 => 36,
    4 => 37,
    5 => 38,
  ),
  38 => 
  array (
    0 => 0,
    1 => 39,
    2 => 40,
    3 => 41,
    4 => 42,
    5 => 43,
    6 => 44,
    7 => 45,
    8 => 46,
  ),
  46 => 
  array (
    0 => 0,
    1 => 47,
    2 => 48,
    3 => 49,
    4 => 50,
    5 => 51,
    6 => 52,
    7 => 53,
    8 => 54,
    9 => 55,
    10 => 56,
    11 => 57,
    12 => 58,
    13 => 59,
    14 => 60,
  ),
  60 => 
  array (
    0 => 0,
    1 => 61,
    2 => 62,
    3 => 63,
    4 => 64,
    5 => 65,
    6 => 66,
    7 => 67,
  ),
  67 => 
  array (
    0 => 0,
    1 => 68,
    2 => 69,
    3 => 70,
    4 => 71,
    5 => 72,
    6 => 73,
    7 => 74,
    8 => 75,
    9 => 76,
    10 => 77,
  ),
  77 => 
  array (
    0 => 0,
    1 => 78,
    2 => 79,
    3 => 80,
    4 => 81,
    5 => 82,
    6 => 83,
    7 => 84,
    8 => 85,
    9 => 86,
    10 => 87,
  ),
  87 => 
  array (
    0 => 0,
    1 => 88,
    2 => 89,
    3 => 90,
    4 => 91,
    5 => 92,
  ),
  92 => 
  array (
    0 => 0,
    1 => 93,
    2 => 94,
    3 => 95,
    4 => 96,
    5 => 97,
    6 => 98,
    7 => 99,
  ),
  99 => 
  array (
    0 => 0,
    1 => 100,
    2 => 102,
    3 => 103,
    4 => 104,
    5 => 105,
    6 => 106,
    7 => 107,
    8 => 108,
    9 => 109,
    10 => 110,
    11 => 111,
    12 => 112,
    13 => 113,
    14 => 114,
    15 => 115,
    16 => 116,
    17 => 117,
    18 => 118,
  ),
  118 => 
  array (
    0 => 0,
    1 => 119,
    2 => 120,
    3 => 121,
    4 => 122,
    5 => 123,
    6 => 124,
    7 => 125,
    8 => 126,
    9 => 127,
    10 => 128,
    11 => 129,
  ),
  129 => 
  array (
    0 => 0,
    1 => 130,
    2 => 131,
    3 => 132,
  ),
  132 => 
  array (
    0 => 0,
    1 => 133,
    2 => 134,
    3 => 135,
  ),
  135 => 
  array (
    0 => 0,
    1 => 136,
    2 => 137,
    3 => 138,
    4 => 139,
    5 => 140,
  ),
) ;
$data = array (
  0 => 
  array (
    1 => 
    array (
      'template' => 'Потолочная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Потолочная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    2 => 
    array (
      'template' => 'Подвесная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Подвесная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    3 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    4 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    5 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Каскадная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  5 => 
  array (
    0 => 
    array (
      'template' => 'Подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подвесной светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  6 => 
  array (
    0 => 
    array (
      'template' => 'Потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Потолочный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  7 => 
  array (
    8 => 
    array (
      'template' => 'Настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    9 => 
    array (
      'template' => 'Настенно-потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    10 => 
    array (
      'template' => 'Бра {$vendor} {$collection} {$article}',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  12 => 
  array (
    13 => 
    array (
      'template' => 'Декоративная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    14 => 
    array (
      'template' => 'Офисная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Офисная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    15 => 
    array (
      'template' => 'Кабинетная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кабинетная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    16 => 
    array (
      'template' => 'Ночник {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    17 => 
    array (
      'template' => 'Детская настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  17 => 
  array (
    18 => 
    array (
      'template' => 'Точечный встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный встраиваемый светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    19 => 
    array (
      'template' => 'Точечный накладной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный накладной светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    20 => 
    array (
      'template' => 'Точечный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный подвесной светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  20 => 
  array (
    21 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с одним плафоном',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    22 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с двумя плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    23 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  23 => 
  array (
    24 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с одним плафоном',
      'feature' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'подвесные',
      ),
    ),
    25 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с двумя и более плафонами',
      'feature' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'подвесные',
      ),
    ),
  ),
  25 => 
  array (
    26 => 
    array (
      'template' => 'Трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Трековый светильник',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'подвесные',
      ),
    ),
    27 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    28 => 
    array (
      'template' => 'Готовая трековая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    29 => 
    array (
      'template' => 'Тросовая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    30 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  30 => 
  array (
    31 => 
    array (
      'template' => 'Магнитный трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Магнитный трековый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    32 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    33 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} **Наименование для блоков питания ARTELAMP Встраиваемых: Блок питания встраиваемый в трек ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article} Выносных: Блок питания ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  33 => 
  array (
    34 => 
    array (
      'template' => 'Подсветка для картин {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для картин',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    35 => 
    array (
      'template' => 'Подсветка для зеркал {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для зеркал',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    36 => 
    array (
      'template' => 'Подсветка для лестниц {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для лестниц',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    37 => 
    array (
      'template' => 'Декоративная подсветка {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная подсветка',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    38 => 
    array (
      'template' => 'Мебельный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Мебельный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  38 => 
  array (
    39 => 
    array (
      'template' => 'Светильник для растений {$vendor} {$collection} {$article}',
      'singular' => 'Светильник для растений',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    40 => 
    array (
      'template' => 'Бактерицидный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Бактерицидный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    41 => 
    array (
      'template' => 'Светильник с лупой {$vendor} {$collection} {$article}',
      'singular' => 'Светильник с лупой',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    42 => 
    array (
      'template' => 'Кольцевая лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кольцевая лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    43 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    44 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    45 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    46 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  46 => 
  array (
    47 => 
    array (
      'template' => 'Фасадный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Фасадный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    48 => 
    array (
      'template' => 'Ландшафтный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Ландшафтный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    49 => 
    array (
      'template' => 'Парковый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Парковый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    50 => 
    array (
      'template' => 'Консольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Консольный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    51 => 
    array (
      'template' => 'Уличный настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    52 => 
    array (
      'template' => 'Уличный настольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    53 => 
    array (
      'template' => 'Уличный потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный потолочный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    54 => 
    array (
      'template' => 'Уличный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный подвесной светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    55 => 
    array (
      'template' => 'Грунтовый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Грунтовый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    56 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Газонный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    57 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Тротуарный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    58 => 
    array (
      'template' => 'Подводный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подводный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    59 => 
    array (
      'template' => 'Прожектор {$vendor} {$collection} {$article}',
      'singular' => 'Прожектор',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    60 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Фонарик',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  60 => 
  array (
    61 => 
    array (
      'template' => 'Встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Даунлайт',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    62 => 
    array (
      'template' => 'Линейный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Линейный',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    63 => 
    array (
      'template' => 'Модульный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Модульный светильник',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    64 => 
    array (
      'template' => 'Карданный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Карданный светильник',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    65 => 
    array (
      'template' => 'Светодиодная панель {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная панель',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    66 => 
    array (
      'template' => 'Светильник грильято {$vendor} {$collection} {$article}',
      'singular' => 'Светильник грильято',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    67 => 
    array (
      'template' => 'Светильник армстронг {$vendor} {$collection} {$article}',
      'singular' => 'Светильник армстронг',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  67 => 
  array (
    68 => 
    array (
      'template' => 'Гирлянда {$vendor} {$collection} {$article}',
      'singular' => 'Гирлянда',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    69 => 
    array (
      'template' => 'Новогодний подвес {$vendor} {$collection} {$article}',
      'singular' => 'Новогодний подвес',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    70 => 
    array (
      'template' => 'Белт-лайт {$vendor} {$collection} {$article}',
      'singular' => 'Белт-лайт',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    71 => 
    array (
      'template' => 'Дюралайт {$vendor} {$collection} {$article}',
      'singular' => 'Дюралайт',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    72 => 
    array (
      'template' => 'Световая фигура {$vendor} {$collection} {$article}',
      'singular' => 'Световая фигура',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    73 => 
    array (
      'template' => 'Светодиодное дерево {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодное дерево',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    74 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Интерьерные украшения',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    75 => 
    array (
      'template' => 'Проектор {$vendor} {$collection} {$article}',
      'singular' => 'Проектор',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    76 => 
    array (
      'template' => 'Диско-шар {$vendor} {$collection} {$article}',
      'singular' => 'Диско-шар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    77 => 
    array (
      'template' => 'Свеча/подсвечник {$vendor} {$collection} {$article}',
      'singular' => 'Свеча',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  77 => 
  array (
    78 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    79 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    80 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    81 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    82 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    83 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    84 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    85 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    86 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    87 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  87 => 
  array (
    88 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Светодиодная лампа',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    89 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Галогенная лампа',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    90 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    91 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    92 => 
    array (
      'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  92 => 
  array (
    93 => 
    array (
      'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    94 => 
    array (
      'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    95 => 
    array (
      'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
      'singular' => 'Блок питания',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    96 => 
    array (
      'template' => 'Профиль для лент ',
      'singular' => 'Профиль для лент',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    97 => 
    array (
      'template' => 'Запчасть для лент',
      'singular' => 'Запчасть для лент',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    98 => 
    array (
      'template' => 'Запчасть для профилей',
      'singular' => 'Запчасть для профилей',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    99 => 
    array (
      'template' => 'Готовый комплект ',
      'singular' => 'Готовый комплект',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
  ),
  99 => 
  array (
    100 => 
    array (
      'template' => 'Розетка Тип розетки цвет IP {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'со шторками',
        1 => 'с крышкой',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'переносные',
        3 => 'выдвижные',
      ),
    ),
    102 => 
    array (
      'template' => '{$osobennost} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    103 => 
    array (
      'template' => 'Рамка кол-во постов цвет {$vendor} {$collection} {$article}',
      'singular' => 'Рамка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    104 => 
    array (
      'template' => '{$osobennost} для какого товара {$vendor} {$collection} {$article}',
      'singular' => 'Панель',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    105 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Светорегулятор',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    106 => 
    array (
      'template' => 'Терморегулятор {$article}',
      'singular' => 'Терморегулятор',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    107 => 
    array (
      'template' => 'Датчик движения {$vendor} {$collection} {$article}',
      'singular' => 'Датчик движения',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    108 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Реле wifi',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    109 => 
    array (
      'template' => 'Таймер {$vendor} {$collection} {$article}',
      'singular' => 'Таймер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    110 => 
    array (
      'template' => 'Звонок {$vendor} {$collection} {$article}',
      'singular' => 'Звонок',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    111 => 
    array (
      'template' => '{$osobennost} кол-во постов {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    112 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Кабель',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    113 => 
    array (
      'template' => 'Патрон {$vendor} {$collection} {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    114 => 
    array (
      'template' => 'Патрон {$vendor} {$collection} {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    115 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Разветвитель',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    116 => 
    array (
      'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    117 => 
    array (
      'template' => 'Наименование поставщика {$vendor} {$collection} {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    118 => 
    array (
      'template' => 'Клемма {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
  ),
  118 => 
  array (
    119 => 
    array (
      'template' => 'Зеркало {$article}',
      'singular' => 'Зеркало',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    120 => 
    array (
      'template' => 'Картина {$article}',
      'singular' => 'Картина',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    121 => 
    array (
      'template' => 'Картина {$article}',
      'singular' => 'Картина',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    122 => 
    array (
      'template' => 'Часы {$vendor} {$collection} {$article}',
      'singular' => 'Часы',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    123 => 
    array (
      'template' => 'Часы {$vendor} {$collection} {$article}',
      'singular' => 'Часы',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    124 => 
    array (
      'template' => 'Часы {$vendor} {$collection} {$article}',
      'singular' => 'Часы',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    125 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    126 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    127 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    128 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    129 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
  ),
  129 => 
  array (
    130 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    131 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    132 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
  ),
  132 => 
  array (
    133 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    134 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    135 => 
    array (
      'template' => 'Ключница {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
  ),
  135 => 
  array (
    136 => 
    array (
      'template' => 'Стол {$article}',
      'singular' => 'Стол',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    137 => 
    array (
      'template' => 'Стул {$article}',
      'singular' => 'Стул',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    138 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Мебель',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    139 => 
    array (
      'template' => 'Стеллаж {$vendor} {$collection} {$article}',
      'singular' => 'Стеллаж',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    140 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Комод',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
  ),
) ;
$Ca = array (
  0 => 'Люстры',
  5 => 'Подвесные светильники',
  6 => 'Потолочные светильники',
  7 => 'Настенные светильники и бра',
  12 => 'Настольные лампы и ночники',
  17 => 'Точечные светильники',
  20 => 'Споты',
  23 => 'Торшеры',
  25 => 'Трековые системы',
  30 => 'Магнитные трековые системы',
  33 => 'Подсветки',
  38 => 'Специализированные светильники',
  46 => 'Уличное освещение',
  60 => 'Офисное освещение',
  67 => 'Праздничное освещение',
  77 => 'Аксессуары',
  87 => 'Лампы',
  92 => 'Светодиодные ленты и комплектующие',
  99 => 'Электроустановочные изделия',
  118 => 'Декор ',
  129 => 'Текстиль',
  132 => 'Посуда',
  135 => 'Мебель',
) ;
$SubCa = array (
  0 => '',
  1 => 'Потолочные люстры',
  2 => 'Подвесные люстры',
  3 => 'Люстры на штанге',
  4 => 'Люстры-вентиляторы',
  5 => 'Каскадные люстры',
  8 => 'Настенные светильники',
  9 => 'Настенно-потолочные светильники',
  10 => 'Бра',
  13 => 'Декоративные настольные лампы',
  14 => 'Офисные настольные лампы',
  15 => 'Кабинетные настольные лампы',
  16 => 'Ночники',
  17 => 'Детские настольные лампы',
  18 => 'Точечные встраиваемые светильники',
  19 => 'Точечные накладные светильники',
  20 => 'Точечные подвесные светильники',
  21 => 'Споты с одним плафоном',
  22 => 'Споты с двумя плафонами',
  23 => 'Споты с тремя и более плафонами',
  24 => 'Торшеры с одним плафоном',
  25 => 'Торшеры с двумя и более плафонами',
  26 => 'Трековые светильники',
  27 => 'Шинопроводы',
  28 => 'Готовые трековые системы',
  29 => 'Тросовые системы',
  30 => 'Комплектующие для трековых систем',
  31 => 'Магнитные трековые светильники',
  32 => 'Магнитные шинопроводы',
  33 => 'Комплектующие для магнитных треков',
  34 => 'Подсветки для картин',
  35 => 'Подсветки для зеркал',
  36 => 'Подсветки для лестниц',
  37 => 'Декоративные подсветки',
  38 => 'Мебельные светильники',
  39 => 'Светильники для растений',
  40 => 'Бактерицидные светильники',
  41 => 'Светильники с лупой',
  42 => 'Кольцевые лампы',
  43 => 'Соляные лампы',
  44 => 'Промышленные светильники',
  45 => 'Светильники для бань и саун',
  46 => 'Аварийные светильники',
  47 => 'Фасадные светильники',
  48 => 'Ландшафтные светильники',
  49 => 'Парковые светильники',
  50 => 'Консольные светильники',
  51 => 'Уличные настенные светильники',
  52 => 'Уличные настольные светильники',
  53 => 'Уличные потолочные светильники',
  54 => 'Уличные подвесные светильники',
  55 => 'Грунтовые светильники',
  56 => 'Газонные светильники',
  57 => 'Тротуарные светильники',
  58 => 'Подводные светильники',
  59 => 'Прожекторы',
  60 => 'Фонарики',
  61 => 'Даунлайты',
  62 => 'Линейные светильники',
  63 => 'Модульные светильники',
  64 => 'Карданные светильники',
  65 => 'Светодиодные панели',
  66 => 'Светильники грильято',
  67 => 'Светильники армстронг',
  68 => 'Гирлянды',
  69 => 'Новогодние подвесы',
  70 => 'Белт-лайт',
  71 => 'Дюралайт',
  72 => 'Светодиодные фигуры',
  73 => 'Светодиодные деревья ',
  74 => 'Интерьерные украшения',
  75 => 'Проекторы',
  76 => 'Диско-шары',
  77 => 'Светодиодные свечи и подсвечники',
  78 => 'Аксессуары для люстр',
  79 => 'Аксессуары для подвесных и потолочных светильников',
  80 => 'Аксессуары для бра',
  81 => 'Аксессуары для настольных ламп',
  82 => 'Аксессуары для точечных светильников',
  83 => 'Аксессуары для спотов',
  84 => 'Аксессуары для уличных светильников',
  85 => 'Аксессуары для специализированных светильников',
  86 => 'Средства для очистки',
  87 => 'Аксессуары для торшеров',
  88 => 'Светодиодные лампы',
  89 => 'Галогенные лампы',
  90 => 'Лампы накаливания',
  91 => 'Энергосберегающие лампы',
  92 => 'Специализированные лампы',
  93 => 'Светодиодные ленты',
  94 => 'Управление светодиодными лентами',
  95 => 'Блоки питания',
  96 => 'Профили для лент',
  97 => 'Комплектующие для лент',
  98 => 'Комплектующие для профилей',
  99 => 'Готовые комплекты',
  100 => 'Розетки',
  102 => 'Выключатели, переключатели',
  103 => 'Рамки и суппорты',
  104 => 'Лицевые панели и заглушки',
  105 => 'Управление светом ',
  106 => 'Терморегуляторы',
  107 => 'Датчики движения',
  108 => 'Реле',
  109 => 'Таймеры',
  110 => 'Звонки',
  111 => 'Удлинители и сетевые фильтры',
  112 => 'Кабели и изоляторы',
  113 => 'Патроны',
  114 => 'Оборудование защиты и коммутации',
  115 => 'Разветвители и переходники',
  116 => 'Монтажные коробки',
  117 => 'Акустические системы',
  118 => 'Клеммы',
  119 => 'Зеркала',
  120 => 'Картины',
  121 => 'Елочные игрушки',
  122 => 'Часы',
  123 => 'Искусственные елки',
  124 => 'Уличный декор',
  125 => 'Постеры',
  126 => 'Цветы',
  127 => 'Модульные картины',
  128 => 'Вазы',
  129 => 'Ключницы',
  130 => 'Подушки',
  131 => 'Пледы',
  132 => 'Ковры',
  133 => 'Чаши',
  134 => 'Блюда',
  135 => 'Конфетницы',
  136 => 'Столы',
  137 => 'Стулья',
  138 => 'Мягкая мебель',
  139 => 'Стеллажи',
  140 => 'Комоды, тумбы',
) ;
return [
'categories'=> $categories,
'subCategories'=> $subCategories,
'whiteList'=> $whiteList,
'data'=> $data,
'originalsCategories'=> $Ca,
'originalsSubCategories'=> $SubCa,
];