<?php

$categories = array(
    0 => 'люстры',
    5 => 'подвесныесветильники',
    6 => 'потолочныесветильники',
    7 => 'настенныесветильникиибра',
    10 => 'настольныелампыиночники',
    15 => 'точечныесветильники',
    18 => 'споты',
    20 => 'торшеры',
    26 => 'трековыесистемы',
    32 => 'магнитныетрековыесистемы',
    35 => 'системыосвещения',
    37 => 'подсветки',
    43 => 'специализированныесветильники',
    52 => 'уличноеосвещение',
    66 => 'офисноеосвещение',
    72 => 'праздничноеосвещение',
    82 => 'управлениесветом',
    83 => 'источникипитания',
    84 => 'аксессуары',
    94 => 'источникисвета',
    100 => 'светодиодныелентыикомплектующие',
    106 => 'электроустановочныеизделия',
    127 => 'мебель',
    'аксессуары' => 84,
    'источникипитания' => 83,
    'источникисвета' => 94,
    'люстры' => 0,
    'магнитныетрековыесистемы' => 32,
    'мебель' => 127,
    'настенныесветильникиибра' => 7,
    'настольныелампыиночники' => 10,
    'офисноеосвещение' => 66,
    'подвесныесветильники' => 5,
    'подсветки' => 37,
    'потолочныесветильники' => 6,
    'праздничноеосвещение' => 72,
    'светодиодныелентыикомплектующие' => 100,
    'системыосвещения' => 35,
    'специализированныесветильники' => 43,
    'споты' => 18,
    'торшеры' => 20,
    'точечныесветильники' => 15,
    'трековыесистемы' => 26,
    'уличноеосвещение' => 52,
    'управлениесветом' => 82,
    'электроустановочныеизделия' => 106,
);
$subCategories = array(
    '' => 0,
    0 => '',
    1 => 'потолочныелюстры',
    2 => 'подвесныелюстры',
    3 => 'люстрынаштанге',
    4 => 'люстрывентиляторы',
    5 => 'каскадныелюстры',
    8 => 'настенныесветильники',
    9 => 'настеннопотолочныесветильники',
    10 => 'бра',
    11 => 'декоративныенастольныелампы',
    12 => 'офисныенастольныелампы',
    13 => 'кабинетныенастольныелампы',
    14 => 'ночники',
    15 => 'детскиенастольныелампы',
    16 => 'точечныевстраиваемыесветильники',
    17 => 'точечныенакладныесветильники',
    18 => 'точечныеподвесныесветильники',
    19 => 'встраиваемыеспоты',
    20 => 'накладныеспоты',
    21 => 'натреноге',
    22 => 'напольные',
    23 => 'сабажуром',
    24 => 'слампойдлячтения',
    25 => 'хрустальные',
    26 => 'состоликом',
    27 => 'трековыесветильники',
    28 => 'шинопроводы',
    29 => 'готовыетрековыесистемы',
    30 => 'трековыесистемынаремнях',
    31 => 'гибкиетрековыесистемы',
    32 => 'комплектующиедлятрековыхсистем',
    33 => 'магнитныетрековыесветильники',
    34 => 'магнитныешинопроводы',
    35 => 'комплектующиедлямагнитныхтреков',
    36 => 'тросовыесистемыосвещения',
    37 => 'модульныесистемыосвещения',
    38 => 'подсветкидлякартин',
    39 => 'подсветкидлязеркал',
    40 => 'подсветкидлялестниц',
    41 => 'декоративныеподсветки',
    42 => 'подсветкидлявитриниполок',
    43 => 'мебельныесветильники',
    44 => 'светильникидлярастений',
    45 => 'бактерицидныесветильники',
    46 => 'светильникислупой',
    47 => 'кольцевыелампы',
    48 => 'соляныелампы',
    49 => 'промышленныесветильники',
    50 => 'светильникидлябаньисаун',
    51 => 'светильникижкх',
    52 => 'аварийныесветильники',
    53 => 'фасадныесветильники',
    54 => 'ландшафтныесветильники',
    55 => 'парковыесветильники',
    56 => 'консольныесветильники',
    57 => 'уличныенастенныесветильники',
    58 => 'уличныенастольныесветильники',
    59 => 'уличныепотолочныесветильники',
    60 => 'уличныеподвесныесветильники',
    61 => 'грунтовыесветильники',
    62 => 'газонныесветильники',
    63 => 'тротуарныесветильники',
    64 => 'подводныесветильники',
    65 => 'прожекторы',
    66 => 'фонарики',
    67 => 'линейныесветильники',
    68 => 'модульныесветильники',
    69 => 'светодиодныепанели',
    70 => 'даунлайты',
    71 => 'карданныесветильники',
    72 => 'фигурныесветильники',
    73 => 'гирлянды',
    74 => 'новогодниеподвесы',
    75 => 'белтлайт',
    76 => 'дюралайт',
    77 => 'светодиодныефигуры',
    78 => 'светодиодныедеревья',
    79 => 'интерьерныеукрашения',
    80 => 'проекторы',
    81 => 'дискошары',
    82 => 'светодиодныесвечииподсвечники',
    85 => 'аксессуарыдлялюстр',
    86 => 'аксессуарыдляподвесныхипотолочныхсветильников',
    87 => 'аксессуарыдлябра',
    88 => 'аксессуарыдлянастольныхламп',
    89 => 'аксессуарыдляточечныхсветильников',
    90 => 'аксессуарыдляспотов',
    91 => 'аксессуарыдляуличныхсветильников',
    92 => 'аксессуарыдляспециализированныхсветильников',
    93 => 'средствадляочистки',
    94 => 'аксессуарыдляторшеров',
    95 => 'светодиодныемодули',
    96 => 'светодиодныелампы',
    97 => 'люминесцентныелампы',
    98 => 'лампынакаливания',
    99 => 'галогенныелампы',
    100 => 'специализированныелампы',
    101 => 'светодиодныеленты',
    102 => 'управлениесветодиоднымилентами',
    103 => 'профилидлялент',
    104 => 'комплектующиедлялент',
    105 => 'комплектующиедляпрофилей',
    106 => 'готовыекомплекты',
    107 => 'розетки',
    109 => 'выключателипереключатели',
    110 => 'рамкиисуппорты',
    111 => 'лицевыепанелиизаглушки',
    112 => 'терморегуляторы',
    113 => 'реле',
    114 => 'таймеры',
    115 => 'звонки',
    116 => 'удлинителисетевыефильтрыблоки',
    117 => 'кабелииизоляторы',
    118 => 'патроны',
    119 => 'оборудованиезащитыикоммутации',
    120 => 'разветвителиипереходники',
    121 => 'монтажныекоробки',
    122 => 'электромонтажныекомплектующие',
    123 => 'клеммы',
    124 => 'акустическиесистемы',
    125 => 'кондиционерыивентиляция',
    126 => 'датчики',
    127 => 'шинопровод',
    128 => 'столы',
    129 => 'стулья',
    130 => 'мягкаямебель',
    131 => 'стеллажи',
    132 => 'комодытумбы',
    'аварийныесветильники' => 52,
    'аксессуарыдлябра' => 87,
    'аксессуарыдлялюстр' => 85,
    'аксессуарыдлянастольныхламп' => 88,
    'аксессуарыдляподвесныхипотолочныхсветильников' => 86,
    'аксессуарыдляспециализированныхсветильников' => 92,
    'аксессуарыдляспотов' => 90,
    'аксессуарыдляторшеров' => 94,
    'аксессуарыдляточечныхсветильников' => 89,
    'аксессуарыдляуличныхсветильников' => 91,
    'акустическиесистемы' => 124,
    'бактерицидныесветильники' => 45,
    'белтлайт' => 75,
    'бра' => 10,
    'встраиваемыеспоты' => 19,
    'выключателипереключатели' => 109,
    'газонныесветильники' => 62,
    'галогенныелампы' => 99,
    'гибкиетрековыесистемы' => 31,
    'гирлянды' => 73,
    'готовыекомплекты' => 106,
    'готовыетрековыесистемы' => 29,
    'грунтовыесветильники' => 61,
    'датчики' => 126,
    'даунлайты' => 70,
    'декоративныенастольныелампы' => 11,
    'декоративныеподсветки' => 41,
    'детскиенастольныелампы' => 15,
    'дискошары' => 81,
    'дюралайт' => 76,
    'звонки' => 115,
    'интерьерныеукрашения' => 79,
    'кабелииизоляторы' => 117,
    'кабинетныенастольныелампы' => 13,
    'карданныесветильники' => 71,
    'каскадныелюстры' => 5,
    'клеммы' => 123,
    'кольцевыелампы' => 47,
    'комодытумбы' => 132,
    'комплектующиедлялент' => 104,
    'комплектующиедлямагнитныхтреков' => 35,
    'комплектующиедляпрофилей' => 105,
    'комплектующиедлятрековыхсистем' => 32,
    'кондиционерыивентиляция' => 125,
    'консольныесветильники' => 56,
    'лампынакаливания' => 98,
    'ландшафтныесветильники' => 54,
    'линейныесветильники' => 67,
    'лицевыепанелиизаглушки' => 111,
    'люминесцентныелампы' => 97,
    'люстрывентиляторы' => 4,
    'люстрынаштанге' => 3,
    'магнитныетрековыесветильники' => 33,
    'магнитныешинопроводы' => 34,
    'мебельныесветильники' => 43,
    'модульныесветильники' => 68,
    'модульныесистемыосвещения' => 37,
    'монтажныекоробки' => 121,
    'мягкаямебель' => 130,
    'накладныеспоты' => 20,
    'напольные' => 22,
    'настеннопотолочныесветильники' => 9,
    'настенныесветильники' => 8,
    'натреноге' => 21,
    'новогодниеподвесы' => 74,
    'ночники' => 14,
    'оборудованиезащитыикоммутации' => 119,
    'офисныенастольныелампы' => 12,
    'парковыесветильники' => 55,
    'патроны' => 118,
    'подвесныелюстры' => 2,
    'подводныесветильники' => 64,
    'подсветкидлявитриниполок' => 42,
    'подсветкидлязеркал' => 39,
    'подсветкидлякартин' => 38,
    'подсветкидлялестниц' => 40,
    'потолочныелюстры' => 1,
    'проекторы' => 80,
    'прожекторы' => 65,
    'промышленныесветильники' => 49,
    'профилидлялент' => 103,
    'разветвителиипереходники' => 120,
    'рамкиисуппорты' => 110,
    'реле' => 113,
    'розетки' => 107,
    'сабажуром' => 23,
    'светильникидлябаньисаун' => 50,
    'светильникидлярастений' => 44,
    'светильникижкх' => 51,
    'светильникислупой' => 46,
    'светодиодныедеревья' => 78,
    'светодиодныелампы' => 96,
    'светодиодныеленты' => 101,
    'светодиодныемодули' => 95,
    'светодиодныепанели' => 69,
    'светодиодныесвечииподсвечники' => 82,
    'светодиодныефигуры' => 77,
    'слампойдлячтения' => 24,
    'соляныелампы' => 48,
    'состоликом' => 26,
    'специализированныелампы' => 100,
    'средствадляочистки' => 93,
    'стеллажи' => 131,
    'столы' => 128,
    'стулья' => 129,
    'таймеры' => 114,
    'терморегуляторы' => 112,
    'точечныевстраиваемыесветильники' => 16,
    'точечныенакладныесветильники' => 17,
    'точечныеподвесныесветильники' => 18,
    'трековыесветильники' => 27,
    'трековыесистемынаремнях' => 30,
    'тросовыесистемыосвещения' => 36,
    'тротуарныесветильники' => 63,
    'удлинителисетевыефильтрыблоки' => 116,
    'уличныенастенныесветильники' => 57,
    'уличныенастольныесветильники' => 58,
    'уличныеподвесныесветильники' => 60,
    'уличныепотолочныесветильники' => 59,
    'управлениесветодиоднымилентами' => 102,
    'фасадныесветильники' => 53,
    'фигурныесветильники' => 72,
    'фонарики' => 66,
    'хрустальные' => 25,
    'шинопровод' => 127,
    'шинопроводы' => 28,
    'электромонтажныекомплектующие' => 122,
);
$whiteList = array(
    0 =>
        array(
            0 => 0,
            1 => 1,
            2 => 2,
            3 => 3,
            4 => 4,
            5 => 5,
        ),
    5 =>
        array(
            0 => 0,
        ),
    6 =>
        array(
            0 => 0,
        ),
    7 =>
        array(
            0 => 0,
            1 => 8,
            2 => 9,
            3 => 10,
        ),
    10 =>
        array(
            0 => 0,
            1 => 11,
            2 => 12,
            3 => 13,
            4 => 14,
            5 => 15,
        ),
    15 =>
        array(
            0 => 0,
            1 => 16,
            2 => 17,
            3 => 18,
        ),
    18 =>
        array(
            0 => 0,
            1 => 19,
            2 => 20,
        ),
    20 =>
        array(
            0 => 0,
            1 => 21,
            2 => 22,
            3 => 23,
            4 => 24,
            5 => 25,
            6 => 26,
        ),
    26 =>
        array(
            0 => 0,
            1 => 27,
            2 => 28,
            3 => 29,
            4 => 30,
            5 => 31,
            6 => 32,
        ),
    32 =>
        array(
            0 => 0,
            1 => 33,
            2 => 34,
            3 => 35,
        ),
    35 =>
        array(
            0 => 0,
            1 => 36,
            2 => 37,
        ),
    37 =>
        array(
            0 => 0,
            1 => 38,
            2 => 39,
            3 => 40,
            4 => 41,
            5 => 42,
            6 => 43,
        ),
    43 =>
        array(
            0 => 0,
            1 => 44,
            2 => 45,
            3 => 46,
            4 => 47,
            5 => 48,
            6 => 49,
            7 => 50,
            8 => 51,
            9 => 52,
        ),
    52 =>
        array(
            0 => 0,
            1 => 53,
            2 => 54,
            3 => 55,
            4 => 56,
            5 => 57,
            6 => 58,
            7 => 59,
            8 => 60,
            9 => 61,
            10 => 62,
            11 => 63,
            12 => 64,
            13 => 65,
            14 => 66,
        ),
    66 =>
        array(
            0 => 0,
            1 => 67,
            2 => 68,
            3 => 69,
            4 => 70,
            5 => 71,
            6 => 72,
        ),
    72 =>
        array(
            0 => 0,
            1 => 73,
            2 => 74,
            3 => 75,
            4 => 76,
            5 => 77,
            6 => 78,
            7 => 79,
            8 => 80,
            9 => 81,
            10 => 82,
        ),
    82 =>
        array(
            0 => 0,
        ),
    83 =>
        array(
            0 => 0,
        ),
    84 =>
        array(
            0 => 0,
            1 => 85,
            2 => 86,
            3 => 87,
            4 => 88,
            5 => 89,
            6 => 90,
            7 => 91,
            8 => 92,
            9 => 93,
            10 => 94,
        ),
    94 =>
        array(
            0 => 0,
            1 => 95,
            2 => 96,
            3 => 97,
            4 => 98,
            5 => 99,
            6 => 100,
        ),
    100 =>
        array(
            0 => 0,
            1 => 101,
            2 => 102,
            3 => 103,
            4 => 104,
            5 => 105,
            6 => 106,
        ),
    106 =>
        array(
            0 => 0,
            1 => 107,
            2 => 109,
            3 => 110,
            4 => 111,
            5 => 112,
            6 => 113,
            7 => 114,
            8 => 115,
            9 => 116,
            10 => 117,
            11 => 118,
            12 => 119,
            13 => 120,
            14 => 121,
            15 => 122,
            16 => 123,
            17 => 124,
            18 => 125,
            19 => 126,
            20 => 127,
        ),
    127 =>
        array(
            0 => 0,
            1 => 128,
            2 => 129,
            3 => 130,
            4 => 131,
            5 => 132,
        ),
);
$data = array(
    0 =>
        array(
            1 =>
                array(
                    'template' => 'Потолочная люстра {$vendor} {$collection} {$article}',
                    'singular' => 'Потолочная люстра',
                    'feature' =>
                        array(
                            0 => 'Люстры-вентиляторы',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
            2 =>
                array(
                    'template' => 'Подвесная люстра {$vendor} {$collection} {$article}',
                    'singular' => 'Подвесная люстра',
                    'feature' =>
                        array(
                            0 => 'Люстры-вентиляторы',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
            3 =>
                array(
                    'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
                    'singular' => 'Люстра на штанге',
                    'feature' =>
                        array(
                            0 => 'Люстры-вентиляторы',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
            4 =>
                array(
                    'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
                    'singular' => 'Люстра-вентилятор',
                    'feature' =>
                        array(
                            0 => 'Люстры-вентиляторы',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
            5 =>
                array(
                    'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
                    'singular' => 'Каскадная люстра',
                    'feature' =>
                        array(
                            0 => 'Люстры-вентиляторы',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
        ),
    5 =>
        array(
            0 =>
                array(
                    'template' => 'Подвесной светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Подвесной светильник',
                    'feature' =>
                        array(
                            0 => 'одинарные',
                            1 => 'двойные',
                            2 => 'тройные (можно оставить фильтр по цоколям)',
                        ),
                    'installType' =>
                        array(
                            0 => '',
                        ),
                ),
        ),
    6 =>
        array(
            0 =>
                array(
                    'template' => 'Потолочный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Потолочный светильник',
                    'feature' =>
                        array(
                            0 => 'одинарные',
                            1 => 'двойные',
                            2 => 'тройные (можно оставить фильтр по цоколям)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    7 =>
        array(
            8 =>
                array(
                    'template' => 'Настенный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Настенный светильник',
                    'feature' =>
                        array(
                            0 => 'одинарные',
                            1 => 'двойные',
                            2 => 'тройные (можно оставить фильтр по цоколям)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            9 =>
                array(
                    'template' => 'Настенно-потолочный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Настенно-потолочный светильник',
                    'feature' =>
                        array(
                            0 => 'одинарные',
                            1 => 'двойные',
                            2 => 'тройные (можно оставить фильтр по цоколям)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            10 =>
                array(
                    'template' => 'Бра {$vendor} {$collection} {$article}',
                    'singular' => 'Бра',
                    'feature' =>
                        array(
                            0 => 'одинарные',
                            1 => 'двойные',
                            2 => 'тройные (можно оставить фильтр по цоколям)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    10 =>
        array(
            11 =>
                array(
                    'template' => 'Декоративная настольная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Декоративная настольная лампа',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            12 =>
                array(
                    'template' => 'Офисная настольная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Офисная настольная лампа',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            13 =>
                array(
                    'template' => 'Кабинетная настольная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Кабинетная настольная лампа',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            14 =>
                array(
                    'template' => 'Ночник {$vendor} {$collection} {$article}',
                    'singular' => 'Ночник',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            15 =>
                array(
                    'template' => 'Детская настольная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Детская настольная лампа',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    15 =>
        array(
            16 =>
                array(
                    'template' => 'Точечный встраиваемый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Точечный встраиваемый светильник',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            17 =>
                array(
                    'template' => 'Точечный накладной светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Точечный накладной светильник',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            18 =>
                array(
                    'template' => 'Точечный подвесной светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Точечный подвесной светильник',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    18 =>
        array(
            19 =>
                array(
                    'template' => 'Спот {$vendor} {$collection} {$article}',
                    'singular' => 'Спот встраиваемый',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            20 =>
                array(
                    'template' => 'Спот {$vendor} {$collection} {$article}',
                    'singular' => 'Спот накладной',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    20 =>
        array(
            21 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер на треноге',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            22 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер напольный',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            23 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер с абажуром',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            24 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер с лампой для чтения',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            25 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер хрустальный',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            26 =>
                array(
                    'template' => 'Торшер {$vendor} {$collection} {$article}',
                    'singular' => 'Торшер со столиком',
                    'feature' =>
                        array(
                            0 => 'на подставке',
                            1 => 'на прищепке',
                            2 => 'на струбцине',
                            3 => 'детские',
                            4 => 'многофункциональные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
        ),
    26 =>
        array(
            27 =>
                array(
                    'template' => 'Трековый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Трековый светильник',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                        ),
                ),
            28 =>
                array(
                    'template' => 'Шинопровод {$vendor} {$collection} {$article}',
                    'singular' => 'Шинопровод',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            29 =>
                array(
                    'template' => 'Готовая трековая система/Готовая трековая система на ремнях {$vendor} {$collection} {$article}',
                    'singular' => 'Готовая трековая система',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            30 =>
                array(
                    'template' => 'В зависимости от товара, смотри лист с подсказками',
                    'singular' => 'Трековый светильник на ремнях',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            31 =>
                array(
                    'template' => '{$osobennost} для гибкого трека {$vendor} {$collection} {$article}',
                    'singular' => 'Гибкая трековая система',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            32 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Комплектующая',
                    'feature' =>
                        array(
                            0 => 'трехфазные',
                            1 => 'однофазные',
                            2 => 'рейлинговые',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    32 =>
        array(
            33 =>
                array(
                    'template' => 'Магнитный трековый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Магнитный трековый светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            34 =>
                array(
                    'template' => 'Магнитный шинопровод {$vendor} {$collection} {$article}',
                    'singular' => 'Магнитный шинопровод',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            35 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article} **Наименование для блоков питания ARTELAMP Встраиваемых: Блок питания встраиваемый в трек ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article} Выносных: Блок питания ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article}',
                    'singular' => 'Комплектующая',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    35 =>
        array(
            36 =>
                array(
                    'template' => 'Комплект тросовой системы {$vendor} {$collection} {$article} Крепление/Комплект креплений для тросовой системы {$vendor} {$collection} {$article} Трос для ленты {$vendor} {$collection} {$article}',
                    'singular' => 'Тросовая система',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            37 =>
                array(
                    'template' => 'Модульный светильник {$vendor} {$collection} {$article} {$osobennost} для модульной системы {$vendor} {$collection} {$article}',
                    'singular' => 'Модульная система',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    37 =>
        array(
            38 =>
                array(
                    'template' => 'Подсветка для картин {$vendor} {$collection} {$article}',
                    'singular' => 'Подсветка для картин',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            39 =>
                array(
                    'template' => 'Подсветка для зеркал {$vendor} {$collection} {$article}',
                    'singular' => 'Подсветка для зеркал',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            40 =>
                array(
                    'template' => 'Подсветка для лестниц {$vendor} {$collection} {$article}',
                    'singular' => 'Подсветка для лестниц',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            41 =>
                array(
                    'template' => 'Декоративная подсветка {$vendor} {$collection} {$article}',
                    'singular' => 'Декоративная подсветка',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            42 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Подсветка для витрин',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            43 =>
                array(
                    'template' => 'Мебельный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Мебельный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    43 =>
        array(
            44 =>
                array(
                    'template' => 'Светильник для растений {$vendor} {$collection} {$article}',
                    'singular' => 'Светильник для растений',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            45 =>
                array(
                    'template' => 'Бактерицидный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Бактерицидный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            46 =>
                array(
                    'template' => 'Светильник с лупой {$vendor} {$collection} {$article}',
                    'singular' => 'Светильник с лупой',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            47 =>
                array(
                    'template' => 'Кольцевая лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Кольцевая лампа',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            48 =>
                array(
                    'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Соляная лампа',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            49 =>
                array(
                    'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Промышленный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            50 =>
                array(
                    'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Светильник для сауны',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            51 =>
                array(
                    'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            52 =>
                array(
                    'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
                    'singular' => 'Аварийный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    52 =>
        array(
            53 =>
                array(
                    'template' => 'Фасадный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Фасадный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            54 =>
                array(
                    'template' => 'Ландшафтный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Ландшафтный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            55 =>
                array(
                    'template' => 'Парковый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Парковый светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            56 =>
                array(
                    'template' => 'Консольный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Консольный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            57 =>
                array(
                    'template' => 'Уличный настенный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Уличный настенный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            58 =>
                array(
                    'template' => 'Уличный настольный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Уличный настольный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            59 =>
                array(
                    'template' => 'Уличный потолочный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Уличный потолочный светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            60 =>
                array(
                    'template' => 'Уличный подвесной светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Уличный подвесной светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            61 =>
                array(
                    'template' => 'Грунтовый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Грунтовый светильник',
                    'feature' =>
                        array(
                            0 => 'магнитные',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            62 =>
                array(
                    'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Газонный светильник',
                    'feature' =>
                        array(
                            0 => 'на солнечных батарейках',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            63 =>
                array(
                    'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Тротуарный светильник',
                    'feature' =>
                        array(
                            0 => 'на солнечных батарейках',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            64 =>
                array(
                    'template' => 'Подводный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Подводный светильник',
                    'feature' =>
                        array(
                            0 => 'на солнечных батарейках',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            65 =>
                array(
                    'template' => 'Прожектор {$vendor} {$collection} {$article}',
                    'singular' => 'Прожектор',
                    'feature' =>
                        array(
                            0 => 'переносные',
                            1 => 'на треноге',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
            66 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Фонарик',
                    'feature' =>
                        array(
                            0 => 'переносные',
                            1 => 'на треноге',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                            1 => 'накладные',
                            2 => 'подвесные',
                        ),
                ),
        ),
    66 =>
        array(
            67 =>
                array(
                    'template' => 'Линейный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Линейный светильник',
                    'feature' =>
                        array(
                            0 => 'переносные',
                            1 => 'на треноге',
                        ),
                    'installType' =>
                        array(
                            0 => 'подвесные',
                            1 => 'накладные',
                            2 => 'встраиваемые',
                        ),
                ),
            68 =>
                array(
                    'template' => 'Модульный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Модульный светильник',
                    'feature' =>
                        array(
                            0 => 'переносные',
                            1 => 'на треноге',
                        ),
                    'installType' =>
                        array(
                            0 => 'подвесные',
                            1 => 'накладные',
                            2 => 'встраиваемые',
                        ),
                ),
            69 =>
                array(
                    'template' => 'Светодиодная панель {$vendor} {$collection} {$article}',
                    'singular' => 'Светодиодная панель',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            70 =>
                array(
                    'template' => 'Встраиваемый светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Встраиваемый светильник',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            71 =>
                array(
                    'template' => 'Карданный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Встраиваемый светильник',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            72 =>
                array(
                    'template' => 'Фигурный светильник {$vendor} {$collection} {$article}',
                    'singular' => 'Фигурный светильник',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    72 =>
        array(
            73 =>
                array(
                    'template' => 'Гирлянда {$vendor} {$collection} {$article}',
                    'singular' => 'Гирлянда',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            74 =>
                array(
                    'template' => 'Новогодний подвес {$vendor} {$collection} {$article}',
                    'singular' => 'Новогодний подвес',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            75 =>
                array(
                    'template' => 'Белт-лайт {$vendor} {$collection} {$article}',
                    'singular' => 'Белт-лайт',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            76 =>
                array(
                    'template' => 'Дюралайт {$vendor} {$collection} {$article}',
                    'singular' => 'Дюралайт',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            77 =>
                array(
                    'template' => 'Световая фигура {$vendor} {$collection} {$article}',
                    'singular' => 'Световая фигура',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            78 =>
                array(
                    'template' => 'Светодиодное дерево {$vendor} {$collection} {$article}',
                    'singular' => 'Светодиодное дерево',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            79 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Интерьерные украшения',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            80 =>
                array(
                    'template' => 'Проектор {$vendor} {$collection} {$article}',
                    'singular' => 'Проектор',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            81 =>
                array(
                    'template' => 'Диско-шар {$vendor} {$collection} {$article}',
                    'singular' => 'Диско-шар',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            82 =>
                array(
                    'template' => 'Свеча/подсвечник {$vendor} {$collection} {$article}',
                    'singular' => 'Свеча',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    82 =>
        array(
            0 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Контроллер',
                    'feature' =>
                        array(
                            0 => 'Для потолков армстронг',
                            1 => 'Для потолков грильято',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    83 =>
        array(
            0 =>
                array(
                    'template' => '{$osobennost} НапряжениеV мощностьW токA {$vendor} {$collection} {$article}',
                    'singular' => 'Блок питания',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    84 =>
        array(
            85 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для люстры',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            86 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
                    'singular' => 'Аксессуар для светильника',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            87 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для бра',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            88 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для настольной лампы',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            89 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для светильника',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            90 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для спота',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            91 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для уличного светильника',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            92 =>
                array(
                    'template' => '... {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для светильника',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            93 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Средство',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            94 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Аксессуар для торшера',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    94 =>
        array(
            95 =>
                array(
                    'template' => 'Светодиодный модуль {$vendor} {$collection} {$article}',
                    'singular' => 'Светодиодный модуль',
                    'feature' =>
                        array(
                            0 => 'вольтаж',
                            1 => 'мощность',
                            2 => 'IP',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            96 =>
                array(
                    'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
                    'singular' => 'Светодиодная лампа',
                    'feature' =>
                        array(
                            0 => 'шар',
                            1 => 'свеча',
                            2 => 'свеча на ветру',
                            3 => 'груша',
                            4 => 'фигурные',
                            5 => 'кукуруза',
                            6 => 'таблетка',
                            7 => 'колба',
                            8 => 'софит',
                            9 => 'рефлектор',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            97 =>
                array(
                    'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
                    'singular' => 'Люминесцентная лампа',
                    'feature' =>
                        array(
                            0 => 'шар',
                            1 => 'свеча',
                            2 => 'свеча на ветру',
                            3 => 'груша',
                            4 => 'фигурные',
                            5 => 'кукуруза',
                            6 => 'таблетка',
                            7 => 'колба',
                            8 => 'софит',
                            9 => 'рефлектор',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            98 =>
                array(
                    'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
                    'singular' => 'Лампа накаливания',
                    'feature' =>
                        array(
                            0 => 'шар',
                            1 => 'свеча',
                            2 => 'свеча на ветру',
                            3 => 'груша',
                            4 => 'фигурные',
                            5 => 'кукуруза',
                            6 => 'таблетка',
                            7 => 'колба',
                            8 => 'софит',
                            9 => 'рефлектор',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            99 =>
                array(
                    'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
                    'singular' => 'Галогенная лампа',
                    'feature' =>
                        array(
                            0 => 'шар',
                            1 => 'свеча',
                            2 => 'свеча на ветру',
                            3 => 'груша',
                            4 => 'фигурные',
                            5 => 'кукуруза',
                            6 => 'таблетка',
                            7 => 'колба',
                            8 => 'софит',
                            9 => 'рефлектор',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            100 =>
                array(
                    'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
                    'singular' => 'Специализированная лампа',
                    'feature' =>
                        array(
                            0 => 'шар',
                            1 => 'свеча',
                            2 => 'свеча на ветру',
                            3 => 'груша',
                            4 => 'фигурные',
                            5 => 'кукуруза',
                            6 => 'таблетка',
                            7 => 'колба',
                            8 => 'софит',
                            9 => 'рефлектор',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
        ),
    100 =>
        array(
            101 =>
                array(
                    'template' => 'Светодиодная лента/Гибкий неон {$collection}(если есть) напряжение V цветовая температура К (в случае, если значение текстовое, то цветовая температура_web) мощность W/m метраж {$vendor} {$article}',
                    'singular' => 'Светодиодная лента',
                    'feature' =>
                        array(
                            0 => 'для закарнизной подвестки',
                            1 => 'подсветка для кухни',
                            2 => 'подсветка для ванной комнаты',
                            3 => 'мебельная подсветка',
                            4 => 'уличная подсветка',
                            5 => 'праздничная подсветка',
                            6 => 'для влажных сред (сауны',
                            7 => 'бассейна)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            102 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Комплектующая',
                    'feature' =>
                        array(
                            0 => 'для закарнизной подвестки',
                            1 => 'подсветка для кухни',
                            2 => 'подсветка для ванной комнаты',
                            3 => 'мебельная подсветка',
                            4 => 'уличная подсветка',
                            5 => 'праздничная подсветка',
                            6 => 'для влажных сред (сауны',
                            7 => 'бассейна)',
                        ),
                    'installType' =>
                        array(
                            0 => 'встраиваемые',
                        ),
                ),
            103 =>
                array(
                    'template' => 'Профиль для лент {$vendor} {$collection} {$article}',
                    'singular' => 'Профиль для лент',
                    'feature' =>
                        array(
                            0 => 'для закарнизной подвестки',
                            1 => 'подсветка для кухни',
                            2 => 'подсветка для ванной комнаты',
                            3 => 'мебельная подсветка',
                            4 => 'уличная подсветка',
                            5 => 'праздничная подсветка',
                            6 => 'для влажных сред (сауны',
                            7 => 'бассейна)',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                            2 => 'подвесные',
                        ),
                ),
            104 =>
                array(
                    'template' => 'Запчасть для лент',
                    'singular' => 'Запчасть для лент',
                    'feature' =>
                        array(
                            0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                            2 => 'подвесные',
                        ),
                ),
            105 =>
                array(
                    'template' => 'Запчасть для профилей',
                    'singular' => 'Запчасть для профилей',
                    'feature' =>
                        array(
                            0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                            2 => 'подвесные',
                        ),
                ),
            106 =>
                array(
                    'template' => 'Готовый комплект {$vendor} {$collection} {$article}',
                    'singular' => 'Готовый комплект',
                    'feature' =>
                        array(
                            0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                            2 => 'подвесные',
                        ),
                ),
        ),
    106 =>
        array(
            107 =>
                array(
                    'template' => 'Розетка Тип розетки IP {$vendor} {$collection} {$article}',
                    'singular' => 'Розетка',
                    'feature' =>
                        array(
                            0 => 'со шторками',
                            1 => 'с крышкой',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                            2 => 'переносные',
                            3 => 'выдвижные',
                        ),
                ),
            109 =>
                array(
                    'template' => '{$osobennost} {$article}',
                    'singular' => 'Выключатель',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            110 =>
                array(
                    'template' => 'Рамка кол-во постов {$vendor} {$collection} {$article}',
                    'singular' => 'Рамка',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            111 =>
                array(
                    'template' => '{$osobennost} для какого товара {$vendor} {$collection} {$article}',
                    'singular' => 'Панель',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            112 =>
                array(
                    'template' => 'Терморегулятор {$article}',
                    'singular' => 'Терморегулятор',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            113 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Реле wifi',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            114 =>
                array(
                    'template' => 'Таймер {$vendor} {$collection} {$article}',
                    'singular' => 'Таймер',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            115 =>
                array(
                    'template' => 'Звонок {$vendor} {$collection} {$article}',
                    'singular' => 'Звонок',
                    'feature' =>
                        array(
                            0 => 'сенсорные',
                            1 => 'клавишные (одноклавишные',
                            2 => 'двухклавишные',
                            3 => 'трехклавишные)',
                            4 => 'кнопочные',
                            5 => 'веревочные',
                            6 => 'повортные',
                            7 => 'карточные',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            116 =>
                array(
                    'template' => '{$osobennost} кол-во постов {$vendor} {$collection} {$article}',
                    'singular' => 'Удлинитель',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            117 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Кабель',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            118 =>
                array(
                    'template' => 'Патрон {$vendor} {$collection} {$article}',
                    'singular' => 'Патрон',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            119 =>
                array(
                    'template' => 'Патрон {$vendor} {$collection} {$article}',
                    'singular' => 'Оборудование',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            120 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Разветвитель',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            121 =>
                array(
                    'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
                    'singular' => 'Распаячная коробка',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            122 =>
                array(
                    'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
                    'singular' => 'Комплектующее',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            123 =>
                array(
                    'template' => 'Клемма {$vendor} {$collection} {$article}',
                    'singular' => 'Клемма',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            124 =>
                array(
                    'template' => 'Наименование поставщика {$vendor} {$collection} {$article}',
                    'singular' => 'Акустическая система',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            125 =>
                array(
                    'template' => '{$osobennost} {$vendor} {$collection} {$article}',
                    'singular' => 'Кондиционгер',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            126 =>
                array(
                    'template' => 'Особенность {$vendor} {$collection} {$article}',
                    'singular' => 'Датчик',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            127 =>
                array(
                    'template' => 'Шинопровод для розеток {$vendor} {$collection} {$article}',
                    'singular' => 'Шинопровод для розеток',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
        ),
    127 =>
        array(
            128 =>
                array(
                    'template' => 'Подгруппа {$vendor} {$collection} {$article}',
                    'singular' => 'Стол',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            129 =>
                array(
                    'template' => 'Подгруппа {$vendor} {$collection} {$article}',
                    'singular' => 'Стул',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            130 =>
                array(
                    'template' => 'Подгруппа {$vendor} {$collection} {$article}',
                    'singular' => 'Мебель',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            131 =>
                array(
                    'template' => 'Стеллаж {$vendor} {$collection} {$article}',
                    'singular' => 'Стеллаж',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
            132 =>
                array(
                    'template' => 'Подгруппа {$vendor} {$collection} {$article}',
                    'singular' => 'Комод',
                    'feature' =>
                        array(
                            0 => 'Подгруппа_web - Розеточный блоки и люки',
                        ),
                    'installType' =>
                        array(
                            0 => 'накладные',
                            1 => 'встраиваемые',
                        ),
                ),
        ),
);
$Ca = array(
    0 => 'Люстры',
    5 => 'Подвесные светильники',
    6 => 'Потолочные светильники',
    7 => 'Настенные светильники и бра',
    10 => 'Настольные лампы и ночники',
    15 => 'Точечные светильники',
    18 => 'Споты',
    20 => 'Торшеры',
    26 => 'Трековые системы',
    32 => 'Магнитные трековые системы',
    35 => 'Системы освещения',
    37 => 'Подсветки',
    43 => 'Специализированные светильники',
    52 => 'Уличное освещение',
    66 => 'Офисное освещение',
    72 => 'Праздничное освещение',
    82 => 'Управление светом',
    83 => 'Источники питания',
    84 => 'Аксессуары',
    94 => 'Источники света',
    100 => 'Светодиодные ленты и комплектующие',
    106 => 'Электроустановочные изделия',
    127 => 'Мебель',
);
$SubCa = array(
    0 => '',
    1 => 'Потолочные люстры',
    2 => 'Подвесные люстры',
    3 => 'Люстры на штанге',
    4 => 'Люстры-вентиляторы',
    5 => 'Каскадные люстры',
    8 => 'Настенные светильники',
    9 => 'Настенно-потолочные светильники',
    10 => 'Бра',
    11 => 'Декоративные настольные лампы',
    12 => 'Офисные настольные лампы',
    13 => 'Кабинетные настольные лампы',
    14 => 'Ночники',
    15 => 'Детские настольные лампы',
    16 => 'Точечные встраиваемые светильники',
    17 => 'Точечные накладные светильники',
    18 => 'Точечные подвесные светильники',
    19 => 'Встраиваемые споты',
    20 => 'Накладные споты',
    21 => 'На треноге',
    22 => 'Напольные',
    23 => 'С абажуром',
    24 => 'С лампой для чтения',
    25 => 'Хрустальные',
    26 => 'Со столиком',
    27 => 'Трековые светильники',
    28 => 'Шинопроводы',
    29 => 'Готовые трековые системы',
    30 => 'Трековые системы на ремнях',
    31 => 'Гибкие трековые системы',
    32 => 'Комплектующие для трековых систем',
    33 => 'Магнитные трековые светильники',
    34 => 'Магнитные шинопроводы',
    35 => 'Комплектующие для магнитных треков',
    36 => 'Тросовые системы освещения',
    37 => 'Модульные системы освещения',
    38 => 'Подсветки для картин',
    39 => 'Подсветки для зеркал',
    40 => 'Подсветки для лестниц',
    41 => 'Декоративные подсветки',
    42 => 'Подсветки для витрин и полок',
    43 => 'Мебельные светильники',
    44 => 'Светильники для растений',
    45 => 'Бактерицидные светильники',
    46 => 'Светильники с лупой',
    47 => 'Кольцевые лампы',
    48 => 'Соляные лампы',
    49 => 'Промышленные светильники',
    50 => 'Светильники для бань и саун',
    51 => 'Светильники ЖКХ',
    52 => 'Аварийные светильники',
    53 => 'Фасадные светильники',
    54 => 'Ландшафтные светильники',
    55 => 'Парковые светильники',
    56 => 'Консольные светильники',
    57 => 'Уличные настенные светильники',
    58 => 'Уличные настольные светильники',
    59 => 'Уличные потолочные светильники',
    60 => 'Уличные подвесные светильники',
    61 => 'Грунтовые светильники',
    62 => 'Газонные светильники',
    63 => 'Тротуарные светильники',
    64 => 'Подводные светильники',
    65 => 'Прожекторы',
    66 => 'Фонарики',
    67 => 'Линейные светильники',
    68 => 'Модульные светильники',
    69 => 'Светодиодные панели',
    70 => 'Даунлайты',
    71 => 'Карданные светильники',
    72 => 'Фигурные светильники',
    73 => 'Гирлянды',
    74 => 'Новогодние подвесы',
    75 => 'Белт-лайт',
    76 => 'Дюралайт',
    77 => 'Светодиодные фигуры',
    78 => 'Светодиодные деревья ',
    79 => 'Интерьерные украшения',
    80 => 'Проекторы',
    81 => 'Диско-шары',
    82 => 'Светодиодные свечи и подсвечники',
    85 => 'Аксессуары для люстр',
    86 => 'Аксессуары для подвесных и потолочных светильников',
    87 => 'Аксессуары для бра',
    88 => 'Аксессуары для настольных ламп',
    89 => 'Аксессуары для точечных светильников',
    90 => 'Аксессуары для спотов',
    91 => 'Аксессуары для уличных светильников',
    92 => 'Аксессуары для специализированных светильников',
    93 => 'Средства для очистки',
    94 => 'Аксессуары для торшеров',
    95 => 'Светодиодные модули',
    96 => 'Светодиодные лампы',
    97 => 'Люминесцентные лампы',
    98 => 'Лампы накаливания',
    99 => 'Галогенные лампы',
    100 => 'Специализированные лампы',
    101 => 'Светодиодные ленты',
    102 => 'Управление светодиодными лентами',
    103 => 'Профили для лент',
    104 => 'Комплектующие для лент',
    105 => 'Комплектующие для профилей',
    106 => 'Готовые комплекты',
    107 => 'Розетки',
    109 => 'Выключатели, переключатели',
    110 => 'Рамки и суппорты',
    111 => 'Лицевые панели и заглушки',
    112 => 'Терморегуляторы',
    113 => 'Реле',
    114 => 'Таймеры',
    115 => 'Звонки',
    116 => 'Удлинители, сетевые фильтры, блоки',
    117 => 'Кабели и изоляторы',
    118 => 'Патроны',
    119 => 'Оборудование защиты и коммутации',
    120 => 'Разветвители и переходники',
    121 => 'Монтажные коробки',
    122 => 'Электромонтажные комплектующие
',
    123 => 'Клеммы',
    124 => 'Акустические системы',
    125 => 'Кондиционеры и вентиляция
',
    126 => 'Датчики',
    127 => 'Шинопровод',
    128 => 'Столы',
    129 => 'Стулья',
    130 => 'Мягкая мебель',
    131 => 'Стеллажи',
    132 => 'Комоды, тумбы',
);
return [
    'categories' => $categories,
    'subCategories' => $subCategories,
    'whiteList' => $whiteList,
    'data' => $data,
    'originalsCategories' => $Ca,
    'originalsSubCategories' => $SubCa,
];