<?php
$categories = array (
  0 => 'люстры',
  'аксессуары' => 15,
  'декор' => 19,
  'лампы' => 16,
  'люстры' => 0,
  'магнитныетрековыесистемы' => 9,
  'настенныесветильникиибра' => 3,
  'настольныелампыиночники' => 4,
  'офисноеосвещение' => 13,
  'подвесныесветильники' => 1,
  'подсветки' => 10,
  'потолочныесветильники' => 2,
  'праздничноеосвещение' => 14,
  'светодиодныелентыикомплектующие' => 17,
  'специализированныесветильники' => 11,
  'споты' => 6,
  'торшеры' => 7,
  'точечныесветильники' => 5,
  'трековыесистемы' => 8,
  'уличноеосвещение' => 12,
  'электроустановочныеизделия' => 18,
  1 => 'подвесныесветильники',
  2 => 'потолочныесветильники',
  3 => 'настенныесветильникиибра',
  4 => 'настольныелампыиночники',
  5 => 'точечныесветильники',
  6 => 'споты',
  7 => 'торшеры',
  8 => 'трековыесистемы',
  9 => 'магнитныетрековыесистемы',
  10 => 'подсветки',
  11 => 'специализированныесветильники',
  12 => 'уличноеосвещение',
  13 => 'офисноеосвещение',
  14 => 'праздничноеосвещение',
  15 => 'аксессуары',
  16 => 'лампы',
  17 => 'светодиодныелентыикомплектующие',
  18 => 'электроустановочныеизделия',
  19 => 'декор',
) ;
$subCategories = array (
  0 => '',
  '' => 0,
  'аварийныесветильники' => 42,
  'аксессуарыдлябра' => 75,
  'аксессуарыдлялюстр' => 73,
  'аксессуарыдлянастольныхламп' => 76,
  'аксессуарыдляподвесныхипотолочныхсветильников' => 74,
  'аксессуарыдляспециализированныхсветильников' => 80,
  'аксессуарыдляспотов' => 78,
  'аксессуарыдляторшеров' => 82,
  'аксессуарыдляточечныхсветильников' => 77,
  'аксессуарыдляуличныхсветильников' => 79,
  'бактерицидныесветильники' => 37,
  'белтлайт' => 65,
  'блокипитания' => 89,
  'брасдвумяплафонами' => 8,
  'брасоднимплафоном' => 7,
  'брастремяиболееплафонами' => 9,
  'выключателипереключатели' => 95,
  'газонныесветильники' => 51,
  'галогенныелампы' => 84,
  'гирлянды' => 63,
  'готовыекомплекты' => 93,
  'готовыетрековыесистемы' => 25,
  'грунтовыесветильники' => 50,
  'датчикидвижения' => 100,
  'даунлайты' => 56,
  'декоративныенастольныелампы' => 10,
  'декоративныеподсветки' => 34,
  'детскиенастольныелампы' => 14,
  'дискошары' => 71,
  'дюралайт' => 66,
  'елочныеигрушки' => 112,
  'звонки' => 103,
  'зеркала' => 110,
  'интерьерныеукрашения' => 69,
  'искусственныеелки' => 114,
  'кабелииизоляторы' => 105,
  'кабинетныенастольныелампы' => 12,
  'карданныесветильники' => 59,
  'картины' => 111,
  'каскадныелюстры' => 4,
  'клеммы' => 109,
  'кольцевыелампы' => 39,
  'комплектующиедлялент' => 91,
  'комплектующиедлямагнитныхтреков' => 30,
  'комплектующиедляпрофилей' => 92,
  'комплектующиедлятрековыхсистем' => 27,
  'консольныесветильники' => 46,
  'лампынакаливания' => 85,
  'ландшафтныесветильники' => 44,
  'линейныесветильники' => 57,
  'лицевыепанелиизаглушки' => 97,
  'люстрынаштанге' => 3,
  'магнитныетрековыесветильники' => 28,
  'магнитныешинопроводы' => 29,
  'мебельныесветильники' => 35,
  'модульныекартины' => 117,
  'модульныесветильники' => 58,
  'монтажныекоробки' => 108,
  'настеннопотолочныесветильники' => 6,
  'настенныесветильники' => 5,
  'новогодниеподвесы' => 64,
  'ночники' => 13,
  'офисныенастольныелампы' => 11,
  'парковыесветильники' => 45,
  'патроны' => 106,
  'подвесныелюстры' => 2,
  'подводныесветильники' => 53,
  'подсветкидлязеркал' => 32,
  'подсветкидлякартин' => 31,
  'подсветкидлялестниц' => 33,
  'постеры' => 115,
  'потолочныелюстры' => 1,
  'проекторы' => 70,
  'прожекторы' => 54,
  'промышленныесветильники' => 41,
  'профилидлялент' => 90,
  'разветвителиипереходники' => 107,
  'рамкиисуппорты' => 96,
  'реле' => 101,
  'розетки' => 94,
  'светильникиармстронг' => 62,
  'светильникигрильято' => 61,
  'светильникидлярастений' => 36,
  'светильникислупой' => 38,
  'светодиодныедеревья' => 68,
  'светодиодныелампы' => 83,
  'светодиодныеленты' => 87,
  'светодиодныепанели' => 60,
  'светодиодныесвечииподсвечники' => 72,
  'светодиодныефигуры' => 67,
  'соляныелампы' => 40,
  'спотысдвумяплафонами' => 19,
  'спотысоднимплафоном' => 18,
  'спотыстремяиболееплафонами' => 20,
  'средствадляочистки' => 81,
  'таймеры' => 102,
  'терморегуляторы' => 99,
  'торшерысдвумяиболееплафонами' => 22,
  'торшерысоднимплафоном' => 21,
  'точечныевстраиваемыесветильники' => 15,
  'точечныенакладныесветильники' => 16,
  'точечныеподвесныесветильники' => 17,
  'трековыесветильники' => 23,
  'тросовыесистемы' => 26,
  'тротуарныесветильники' => 52,
  'удлинителиисетевыефильтры' => 104,
  'уличныенастенныесветильники' => 47,
  'уличныеподвесныесветильники' => 49,
  'уличныепотолочныесветильники' => 48,
  'управлениесветодиоднымилентами' => 88,
  'управлениесветом' => 98,
  'фасадныесветильники' => 43,
  'фонарики' => 55,
  'цветы' => 116,
  'часы' => 113,
  'шинопроводы' => 24,
  'энергосберегающиелампы' => 86,
  1 => 'потолочныелюстры',
  2 => 'подвесныелюстры',
  3 => 'люстрынаштанге',
  4 => 'каскадныелюстры',
  5 => 'настенныесветильники',
  6 => 'настеннопотолочныесветильники',
  7 => 'брасоднимплафоном',
  8 => 'брасдвумяплафонами',
  9 => 'брастремяиболееплафонами',
  10 => 'декоративныенастольныелампы',
  11 => 'офисныенастольныелампы',
  12 => 'кабинетныенастольныелампы',
  13 => 'ночники',
  14 => 'детскиенастольныелампы',
  15 => 'точечныевстраиваемыесветильники',
  16 => 'точечныенакладныесветильники',
  17 => 'точечныеподвесныесветильники',
  18 => 'спотысоднимплафоном',
  19 => 'спотысдвумяплафонами',
  20 => 'спотыстремяиболееплафонами',
  21 => 'торшерысоднимплафоном',
  22 => 'торшерысдвумяиболееплафонами',
  23 => 'трековыесветильники',
  24 => 'шинопроводы',
  25 => 'готовыетрековыесистемы',
  26 => 'тросовыесистемы',
  27 => 'комплектующиедлятрековыхсистем',
  28 => 'магнитныетрековыесветильники',
  29 => 'магнитныешинопроводы',
  30 => 'комплектующиедлямагнитныхтреков',
  31 => 'подсветкидлякартин',
  32 => 'подсветкидлязеркал',
  33 => 'подсветкидлялестниц',
  34 => 'декоративныеподсветки',
  35 => 'мебельныесветильники',
  36 => 'светильникидлярастений',
  37 => 'бактерицидныесветильники',
  38 => 'светильникислупой',
  39 => 'кольцевыелампы',
  40 => 'соляныелампы',
  41 => 'промышленныесветильники',
  42 => 'аварийныесветильники',
  43 => 'фасадныесветильники',
  44 => 'ландшафтныесветильники',
  45 => 'парковыесветильники',
  46 => 'консольныесветильники',
  47 => 'уличныенастенныесветильники',
  48 => 'уличныепотолочныесветильники',
  49 => 'уличныеподвесныесветильники',
  50 => 'грунтовыесветильники',
  51 => 'газонныесветильники',
  52 => 'тротуарныесветильники',
  53 => 'подводныесветильники',
  54 => 'прожекторы',
  55 => 'фонарики',
  56 => 'даунлайты',
  57 => 'линейныесветильники',
  58 => 'модульныесветильники',
  59 => 'карданныесветильники',
  60 => 'светодиодныепанели',
  61 => 'светильникигрильято',
  62 => 'светильникиармстронг',
  63 => 'гирлянды',
  64 => 'новогодниеподвесы',
  65 => 'белтлайт',
  66 => 'дюралайт',
  67 => 'светодиодныефигуры',
  68 => 'светодиодныедеревья',
  69 => 'интерьерныеукрашения',
  70 => 'проекторы',
  71 => 'дискошары',
  72 => 'светодиодныесвечииподсвечники',
  73 => 'аксессуарыдлялюстр',
  74 => 'аксессуарыдляподвесныхипотолочныхсветильников',
  75 => 'аксессуарыдлябра',
  76 => 'аксессуарыдлянастольныхламп',
  77 => 'аксессуарыдляточечныхсветильников',
  78 => 'аксессуарыдляспотов',
  79 => 'аксессуарыдляуличныхсветильников',
  80 => 'аксессуарыдляспециализированныхсветильников',
  81 => 'средствадляочистки',
  82 => 'аксессуарыдляторшеров',
  83 => 'светодиодныелампы',
  84 => 'галогенныелампы',
  85 => 'лампынакаливания',
  86 => 'энергосберегающиелампы',
  87 => 'светодиодныеленты',
  88 => 'управлениесветодиоднымилентами',
  89 => 'блокипитания',
  90 => 'профилидлялент',
  91 => 'комплектующиедлялент',
  92 => 'комплектующиедляпрофилей',
  93 => 'готовыекомплекты',
  94 => 'розетки',
  95 => 'выключателипереключатели',
  96 => 'рамкиисуппорты',
  97 => 'лицевыепанелиизаглушки',
  98 => 'управлениесветом',
  99 => 'терморегуляторы',
  100 => 'датчикидвижения',
  101 => 'реле',
  102 => 'таймеры',
  103 => 'звонки',
  104 => 'удлинителиисетевыефильтры',
  105 => 'кабелииизоляторы',
  106 => 'патроны',
  107 => 'разветвителиипереходники',
  108 => 'монтажныекоробки',
  109 => 'клеммы',
  110 => 'зеркала',
  111 => 'картины',
  112 => 'елочныеигрушки',
  113 => 'часы',
  114 => 'искусственныеелки',
  115 => 'постеры',
  116 => 'цветы',
  117 => 'модульныекартины',
) ;
$whiteList = array (
  0 => 
  array (
    0 => 0,
    1 => 1,
    2 => 2,
    3 => 3,
    4 => 4,
  ),
  1 => 
  array (
    0 => 0,
  ),
  2 => 
  array (
    0 => 0,
  ),
  3 => 
  array (
    0 => 0,
    1 => 5,
    2 => 6,
    3 => 7,
    4 => 8,
    5 => 9,
  ),
  4 => 
  array (
    0 => 0,
    1 => 10,
    2 => 11,
    3 => 12,
    4 => 13,
    5 => 14,
  ),
  5 => 
  array (
    0 => 0,
    1 => 15,
    2 => 16,
    3 => 17,
  ),
  6 => 
  array (
    0 => 0,
    1 => 18,
    2 => 19,
    3 => 20,
  ),
  7 => 
  array (
    0 => 0,
    1 => 21,
    2 => 22,
  ),
  8 => 
  array (
    0 => 0,
    1 => 23,
    2 => 24,
    3 => 25,
    4 => 26,
    5 => 27,
  ),
  9 => 
  array (
    0 => 0,
    1 => 28,
    2 => 29,
    3 => 30,
  ),
  10 => 
  array (
    0 => 0,
    1 => 31,
    2 => 32,
    3 => 33,
    4 => 34,
    5 => 35,
  ),
  11 => 
  array (
    0 => 0,
    1 => 36,
    2 => 37,
    3 => 38,
    4 => 39,
    5 => 40,
    6 => 41,
    7 => 42,
  ),
  12 => 
  array (
    0 => 0,
    1 => 43,
    2 => 44,
    3 => 45,
    4 => 46,
    5 => 47,
    6 => 48,
    7 => 49,
    8 => 50,
    9 => 51,
    10 => 52,
    11 => 53,
    12 => 54,
    13 => 55,
  ),
  13 => 
  array (
    0 => 0,
    1 => 56,
    2 => 57,
    3 => 58,
    4 => 59,
    5 => 60,
    6 => 61,
    7 => 62,
  ),
  14 => 
  array (
    0 => 0,
    1 => 63,
    2 => 64,
    3 => 65,
    4 => 66,
    5 => 67,
    6 => 68,
    7 => 69,
    8 => 70,
    9 => 71,
    10 => 72,
  ),
  15 => 
  array (
    0 => 0,
    1 => 73,
    2 => 74,
    3 => 75,
    4 => 76,
    5 => 77,
    6 => 78,
    7 => 79,
    8 => 80,
    9 => 81,
    10 => 82,
  ),
  16 => 
  array (
    0 => 0,
    1 => 83,
    2 => 84,
    3 => 85,
    4 => 86,
  ),
  17 => 
  array (
    0 => 0,
    1 => 87,
    2 => 88,
    3 => 89,
    4 => 90,
    5 => 91,
    6 => 92,
    7 => 93,
  ),
  18 => 
  array (
    0 => 0,
    1 => 94,
    2 => 95,
    3 => 96,
    4 => 97,
    5 => 98,
    6 => 99,
    7 => 100,
    8 => 101,
    9 => 102,
    10 => 103,
    11 => 104,
    12 => 105,
    13 => 106,
    14 => 107,
    15 => 108,
    16 => 109,
  ),
  19 => 
  array (
    0 => 0,
    1 => 110,
    2 => 111,
    3 => 112,
    4 => 113,
    5 => 114,
    6 => 115,
    7 => 116,
    8 => 117,
  ),
) ;
$data = array (
  0 => 
  array (
    1 => 
    array (
      'template' => 'Потолочная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Потолочная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    2 => 
    array (
      'template' => 'Подвесная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Подвесная люстра',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    3 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    4 => 
    array (
      'template' => '',
      'singular' => 'Каскадная люстра',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  1 => 
  array (
    0 => 
    array (
      'template' => 'Подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подвесной светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  2 => 
  array (
    0 => 
    array (
      'template' => 'Потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  3 => 
  array (
    5 => 
    array (
      'template' => 'Настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    6 => 
    array (
      'template' => 'Настенно-потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    7 => 
    array (
      'template' => 'Бра {$vendor} {$collection} {$article}',
      'singular' => 'Бра с одним плафоном',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    8 => 
    array (
      'template' => '',
      'singular' => 'Бра с двумя плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    9 => 
    array (
      'template' => '',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  4 => 
  array (
    10 => 
    array (
      'template' => 'Декоративная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    11 => 
    array (
      'template' => 'Офисная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Офисная настольная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    12 => 
    array (
      'template' => 'Кабинетная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кабинетная настольная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    13 => 
    array (
      'template' => 'Ночник {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    14 => 
    array (
      'template' => 'Детская настольная лампа {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  5 => 
  array (
    15 => 
    array (
      'template' => 'Точечный встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный встраиваемый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    16 => 
    array (
      'template' => 'Точечный накладной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный накладной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    17 => 
    array (
      'template' => 'Точечный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный подвесной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  6 => 
  array (
    18 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с одним плафоном',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    19 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с двумя плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    20 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  7 => 
  array (
    21 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с одним плафоном',
      'feature' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'подвесные',
      ),
    ),
    22 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с двумя и более плафонами',
      'feature' => 
      array (
        0 => 'со столиком',
        1 => 'с лампой для чтения',
        2 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  8 => 
  array (
    23 => 
    array (
      'template' => 'Трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Трековый светильник',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    24 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    25 => 
    array (
      'template' => 'Готовая трековая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    26 => 
    array (
      'template' => 'Тросовая система {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    27 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  9 => 
  array (
    28 => 
    array (
      'template' => 'Магнитный трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Магнитный трековый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    29 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    30 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} **Наименование для блоков питания ARTELAMP Встраиваемых: Блок питания встраиваемый в трек ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article} Выносных: Блок питания ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  10 => 
  array (
    31 => 
    array (
      'template' => 'Подсветка для картин {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для картин',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    32 => 
    array (
      'template' => 'Подсветка для зеркал {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для зеркал',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    33 => 
    array (
      'template' => 'Подсветка для лестниц {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для лестниц',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    34 => 
    array (
      'template' => 'Декоративная подсветка {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная подсветка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    35 => 
    array (
      'template' => 'Мебельный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Мебельный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  11 => 
  array (
    36 => 
    array (
      'template' => 'Светильник для растений {$vendor} {$collection} {$article}',
      'singular' => 'Светильник для растений',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    37 => 
    array (
      'template' => 'Бактерицидный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Бактерицидный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    38 => 
    array (
      'template' => 'Светильник с лупой {$vendor} {$collection} {$article}',
      'singular' => 'Светильник с лупой',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    39 => 
    array (
      'template' => 'Кольцевая лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кольцевая лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    40 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    41 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    42 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  12 => 
  array (
    43 => 
    array (
      'template' => 'Фасадный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Фасадный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    44 => 
    array (
      'template' => 'Ландшафтный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Ландшафтный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    45 => 
    array (
      'template' => 'Парковый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Парковый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    46 => 
    array (
      'template' => 'Консольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Консольный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    47 => 
    array (
      'template' => 'Уличный настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    48 => 
    array (
      'template' => 'Уличный потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный потолочный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    49 => 
    array (
      'template' => 'Уличный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный подвесной светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    50 => 
    array (
      'template' => 'Грунтовый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Грунтовый светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    51 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Газонный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    52 => 
    array (
      'template' => '',
      'singular' => 'Тротуарный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    53 => 
    array (
      'template' => 'Подводный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подводный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    54 => 
    array (
      'template' => 'Прожектор {$vendor} {$collection} {$article}',
      'singular' => 'Прожектор',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    55 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Фонарик',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  13 => 
  array (
    56 => 
    array (
      'template' => 'Встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Даунлайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    57 => 
    array (
      'template' => 'Линейный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Линейный',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    58 => 
    array (
      'template' => 'Модульный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Модульный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    59 => 
    array (
      'template' => 'Карданный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Карданный светильник',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    60 => 
    array (
      'template' => 'Светодиодная панель {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная панель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    61 => 
    array (
      'template' => 'Светильник грильято {$vendor} {$collection} {$article}',
      'singular' => 'Светильник грильято',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    62 => 
    array (
      'template' => 'Светильник армстронг {$vendor} {$collection} {$article}',
      'singular' => 'Светильник армстронг',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  14 => 
  array (
    63 => 
    array (
      'template' => 'Гирлянда {$vendor} {$collection} {$article}',
      'singular' => 'Гирлянда',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    64 => 
    array (
      'template' => 'Новогодний подвес {$vendor} {$collection} {$article}',
      'singular' => 'Новогодний подвес',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    65 => 
    array (
      'template' => 'Белт-лайт {$vendor} {$collection} {$article}',
      'singular' => 'Белт-лайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    66 => 
    array (
      'template' => 'Дюралайт {$vendor} {$collection} {$article}',
      'singular' => 'Дюралайт',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    67 => 
    array (
      'template' => 'Световая фигура {$vendor} {$collection} {$article}',
      'singular' => 'Световая фигура',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    68 => 
    array (
      'template' => 'Светодиодное дерево {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодное дерево',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    69 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Интерьерные украшения',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    70 => 
    array (
      'template' => 'Проектор {$vendor} {$collection} {$article}',
      'singular' => 'Проектор',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    71 => 
    array (
      'template' => 'Диско-шар {$vendor} {$collection} {$article}',
      'singular' => 'Диско-шар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    72 => 
    array (
      'template' => 'Свеча/подсвечник {$vendor} {$collection} {$article}',
      'singular' => 'Свеча',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  15 => 
  array (
    73 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    74 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    75 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    76 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    77 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    78 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    79 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    80 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    81 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    82 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  16 => 
  array (
    83 => 
    array (
      'template' => 'Светодиодная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная лампа',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    84 => 
    array (
      'template' => 'Галогенная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Галогенная лампа',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    85 => 
    array (
      'template' => 'Лампа накаливания {$vendor} {$collection} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    86 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  17 => 
  array (
    87 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    88 => 
    array (
      'template' => '',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    89 => 
    array (
      'template' => '',
      'singular' => 'Блок питания',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    90 => 
    array (
      'template' => 'Профиль для лент ',
      'singular' => 'Профиль для лент',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    91 => 
    array (
      'template' => 'Запчасть для лент',
      'singular' => 'Запчасть для лент',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    92 => 
    array (
      'template' => 'Запчасть для профилей',
      'singular' => 'Запчасть для профилей',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    93 => 
    array (
      'template' => 'Готовый комплект ',
      'singular' => 'Готовый комплект',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  18 => 
  array (
    94 => 
    array (
      'template' => 'Розетка Тип розетки цвет IP {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'со шторками',
        1 => 'с крышкой',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'переносные',
        3 => 'выдвижные',
      ),
    ),
    0 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    95 => 
    array (
      'template' => '{$osobennost} {$article}',
      'singular' => NULL,
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    96 => 
    array (
      'template' => 'Рамка кол-во постов цвет {$vendor} {$collection} {$article}',
      'singular' => 'Рамка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    97 => 
    array (
      'template' => '{$osobennost} для какого товара {$vendor} {$collection} {$article}',
      'singular' => 'Панель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    98 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Светорегулятор',
      'feature' => 
      array (
        0 => 'клавишные',
        1 => 'поворотные',
        2 => 'сенсорные',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    99 => 
    array (
      'template' => 'Терморегулятор {$article}',
      'singular' => 'Терморегулятор',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    100 => 
    array (
      'template' => 'Датчик движения {$vendor} {$collection} {$article}',
      'singular' => 'Датчик движения',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    101 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Реле wifi',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    102 => 
    array (
      'template' => 'Таймер {$vendor} {$collection} {$article}',
      'singular' => 'Таймер',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    103 => 
    array (
      'template' => 'Звонок {$vendor} {$collection} {$article}',
      'singular' => 'Звонок',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    104 => 
    array (
      'template' => '{$osobennost} кол-во постов {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    105 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Кабель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    106 => 
    array (
      'template' => 'Патрон {$vendor} {$collection} {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    107 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Разветвитель',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    108 => 
    array (
      'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    109 => 
    array (
      'template' => 'Клемма {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  19 => 
  array (
    110 => 
    array (
      'template' => 'Зеркало {$article}',
      'singular' => 'Зеркало',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => 'напольные',
        1 => 'настенные',
        2 => 'настольные',
      ),
    ),
    111 => 
    array (
      'template' => 'Картина {$article}',
      'singular' => 'Картина',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    112 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    113 => 
    array (
      'template' => 'Часы {$vendor} {$collection} {$article}',
      'singular' => 'Часы',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    114 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    115 => 
    array (
      'template' => 'Постер {$vendor} {$collection} {$article}',
      'singular' => 'Постер',
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    116 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    117 => 
    array (
      'template' => '',
      'singular' => NULL,
      'feature' => 
      array (
        0 => '',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
) ;
$Ca = array (
  0 => 'Люстры',
  1 => 'Подвесные светильники',
  2 => 'Потолочные светильники',
  3 => 'Настенные светильники и бра',
  4 => 'Настольные лампы и ночники',
  5 => 'Точечные светильники',
  6 => 'Споты',
  7 => 'Торшеры',
  8 => 'Трековые системы',
  9 => 'Магнитные трековые системы',
  10 => 'Подсветки',
  11 => 'Специализированные светильники',
  12 => 'Уличное освещение',
  13 => 'Офисное освещение',
  14 => 'Праздничное освещение',
  15 => 'Аксессуары',
  16 => 'Лампы',
  17 => 'Светодиодные ленты и комплектующие',
  18 => 'Электроустановочные изделия',
  19 => 'Декор ',
) ;
$SubCa = array (
  0 => NULL,
  1 => 'Потолочные люстры',
  2 => 'Подвесные люстры',
  3 => 'Люстры на штанге',
  4 => 'Каскадные люстры',
  5 => 'Настенные светильники',
  6 => 'Настенно-потолочные светильники',
  7 => 'Бра с одним плафоном',
  8 => 'Бра с двумя плафонами',
  9 => 'Бра с тремя и более плафонами',
  10 => 'Декоративные настольные лампы',
  11 => 'Офисные настольные лампы',
  12 => 'Кабинетные настольные лампы',
  13 => 'Ночники',
  14 => 'Детские настольные лампы',
  15 => 'Точечные встраиваемые светильники',
  16 => 'Точечные накладные светильники',
  17 => 'Точечные подвесные светильники',
  18 => 'Споты с одним плафоном',
  19 => 'Споты с двумя плафонами',
  20 => 'Споты с тремя и более плафонами',
  21 => 'Торшеры с одним плафоном',
  22 => 'Торшеры с двумя и более плафонами',
  23 => 'Трековые светильники',
  24 => 'Шинопроводы',
  25 => 'Готовые трековые системы',
  26 => 'Тросовые системы',
  27 => 'Комплектующие для трековых систем',
  28 => 'Магнитные трековые светильники',
  29 => 'Магнитные шинопроводы',
  30 => 'Комплектующие для магнитных треков',
  31 => 'Подсветки для картин',
  32 => 'Подсветки для зеркал',
  33 => 'Подсветки для лестниц',
  34 => 'Декоративные подсветки',
  35 => 'Мебельные светильники',
  36 => 'Светильники для растений',
  37 => 'Бактерицидные светильники',
  38 => 'Светильники с лупой',
  39 => 'Кольцевые лампы',
  40 => 'Соляные лампы',
  41 => 'Промышленные светильники',
  42 => 'Аварийные светильники',
  43 => 'Фасадные светильники',
  44 => 'Ландшафтные светильники',
  45 => 'Парковые светильники',
  46 => 'Консольные светильники',
  47 => 'Уличные настенные светильники',
  48 => 'Уличные потолочные светильники',
  49 => 'Уличные подвесные светильники',
  50 => 'Грунтовые светильники',
  51 => 'Газонные светильники',
  52 => 'Тротуарные светильники',
  53 => 'Подводные светильники',
  54 => 'Прожекторы',
  55 => 'Фонарики',
  56 => 'Даунлайты',
  57 => 'Линейные светильники',
  58 => 'Модульные светильники',
  59 => 'Карданные светильники',
  60 => 'Светодиодные панели',
  61 => 'Светильники грильято',
  62 => 'Светильники армстронг',
  63 => 'Гирлянды',
  64 => 'Новогодние подвесы',
  65 => 'Белт-лайт',
  66 => 'Дюралайт',
  67 => 'Светодиодные фигуры',
  68 => 'Светодиодные деревья ',
  69 => 'Интерьерные украшения',
  70 => 'Проекторы',
  71 => 'Диско-шары',
  72 => 'Светодиодные свечи и подсвечники',
  73 => 'Аксессуары для люстр',
  74 => 'Аксессуары для подвесных и потолочных светильников',
  75 => 'Аксессуары для бра',
  76 => 'Аксессуары для настольных ламп',
  77 => 'Аксессуары для точечных светильников',
  78 => 'Аксессуары для спотов',
  79 => 'Аксессуары для уличных светильников',
  80 => 'Аксессуары для специализированных светильников',
  81 => 'Средства для очистки',
  82 => 'Аксессуары для торшеров',
  83 => 'Светодиодные лампы',
  84 => 'Галогенные лампы',
  85 => 'Лампы накаливания',
  86 => 'Энергосберегающие лампы',
  87 => 'Светодиодные ленты',
  88 => 'Управление светодиодными лентами',
  89 => 'Блоки питания',
  90 => 'Профили для лент',
  91 => 'Комплектующие для лент',
  92 => 'Комплектующие для профилей',
  93 => 'Готовые комплекты',
  94 => 'Розетки',
  95 => 'Выключатели, переключатели',
  96 => 'Рамки и суппорты',
  97 => 'Лицевые панели и заглушки',
  98 => 'Управление светом ',
  99 => 'Терморегуляторы',
  100 => 'Датчики движения',
  101 => 'Реле',
  102 => 'Таймеры',
  103 => 'Звонки',
  104 => 'Удлинители и сетевые фильтры',
  105 => 'Кабели и изоляторы',
  106 => 'Патроны',
  107 => 'Разветвители и переходники',
  108 => 'Монтажные коробки',
  109 => 'Клеммы',
  110 => 'Зеркала',
  111 => 'Картины',
  112 => 'Елочные игрушки',
  113 => 'Часы',
  114 => 'Искусственные елки',
  115 => 'Постеры',
  116 => 'Цветы',
  117 => 'Модульные картины',
) ;
return [
'categories'=> $categories,
'subCategories'=> $subCategories,
'whiteList'=> $whiteList,
'data'=> $data,
'originalsCategories'=> $Ca,
'originalsSubCategories'=> $SubCa,
];