<?php
$categories = array (
  0 => 'люстры',
  5 => 'подвесныесветильники',
  6 => 'потолочныесветильники',
  7 => 'настенныесветильникиибра',
  10 => 'настольныелампыиночники',
  15 => 'точечныесветильники',
  18 => 'споты',
  20 => 'торшеры',
  26 => 'трековыесистемы',
  32 => 'магнитныетрековыесистемы',
  35 => 'подсветки',
  41 => 'специализированныесветильники',
  50 => 'уличноеосвещение',
  64 => 'офисноеосвещение',
  69 => 'праздничноеосвещение',
  79 => 'управлениесветом',
  80 => 'аксессуары',
  90 => 'лампы',
  95 => 'светодиодныелентыикомплектующие',
  102 => 'электроустановочныеизделия',
  123 => 'мебель',
  'аксессуары' => 80,
  'лампы' => 90,
  'люстры' => 0,
  'магнитныетрековыесистемы' => 32,
  'мебель' => 123,
  'настенныесветильникиибра' => 7,
  'настольныелампыиночники' => 10,
  'офисноеосвещение' => 64,
  'подвесныесветильники' => 5,
  'подсветки' => 35,
  'потолочныесветильники' => 6,
  'праздничноеосвещение' => 69,
  'светодиодныелентыикомплектующие' => 95,
  'специализированныесветильники' => 41,
  'споты' => 18,
  'торшеры' => 20,
  'точечныесветильники' => 15,
  'трековыесистемы' => 26,
  'уличноеосвещение' => 50,
  'управлениесветом' => 79,
  'электроустановочныеизделия' => 102,
) ;
$subCategories = array (
  '' => 0,
  0 => '',
  1 => 'потолочныелюстры',
  2 => 'подвесныелюстры',
  3 => 'люстрынаштанге',
  4 => 'люстрывентиляторы',
  5 => 'каскадныелюстры',
  8 => 'настенныесветильники',
  9 => 'настеннопотолочныесветильники',
  10 => 'бра',
  11 => 'декоративныенастольныелампы',
  12 => 'офисныенастольныелампы',
  13 => 'кабинетныенастольныелампы',
  14 => 'ночники',
  15 => 'детскиенастольныелампы',
  16 => 'точечныевстраиваемыесветильники',
  17 => 'точечныенакладныесветильники',
  18 => 'точечныеподвесныесветильники',
  19 => 'встраиваемыеспоты',
  20 => 'накладныеспоты',
  21 => 'натреноге',
  22 => 'напольные',
  23 => 'сабажуром',
  24 => 'слампойдлячтения',
  25 => 'хрустальные',
  26 => 'состоликом',
  27 => 'трековыесветильники',
  28 => 'шинопроводы',
  29 => 'готовыетрековыесистемы',
  30 => 'тросовыесистемы',
  31 => 'трековыесистемынаремнях',
  32 => 'комплектующиедлятрековыхсистем',
  33 => 'магнитныетрековыесветильники',
  34 => 'магнитныешинопроводы',
  35 => 'комплектующиедлямагнитныхтреков',
  36 => 'подсветкидлякартин',
  37 => 'подсветкидлязеркал',
  38 => 'подсветкидлялестниц',
  39 => 'декоративныеподсветки',
  40 => 'подсветкидлявитриниполок',
  41 => 'мебельныесветильники',
  42 => 'светильникидлярастений',
  43 => 'бактерицидныесветильники',
  44 => 'светильникислупой',
  45 => 'кольцевыелампы',
  46 => 'соляныелампы',
  47 => 'промышленныесветильники',
  48 => 'светильникидлябаньисаун',
  49 => 'светильникижкх',
  50 => 'аварийныесветильники',
  51 => 'фасадныесветильники',
  52 => 'ландшафтныесветильники',
  53 => 'парковыесветильники',
  54 => 'консольныесветильники',
  55 => 'уличныенастенныесветильники',
  56 => 'уличныенастольныесветильники',
  57 => 'уличныепотолочныесветильники',
  58 => 'уличныеподвесныесветильники',
  59 => 'грунтовыесветильники',
  60 => 'газонныесветильники',
  61 => 'тротуарныесветильники',
  62 => 'подводныесветильники',
  63 => 'прожекторы',
  64 => 'фонарики',
  65 => 'даунлайты',
  66 => 'линейныесветильники',
  67 => 'модульныесветильники',
  68 => 'карданныесветильники',
  69 => 'светодиодныепанели',
  70 => 'гирлянды',
  71 => 'новогодниеподвесы',
  72 => 'белтлайт',
  73 => 'дюралайт',
  74 => 'светодиодныефигуры',
  75 => 'светодиодныедеревья',
  76 => 'интерьерныеукрашения',
  77 => 'проекторы',
  78 => 'дискошары',
  79 => 'светодиодныесвечииподсвечники',
  81 => 'аксессуарыдлялюстр',
  82 => 'аксессуарыдляподвесныхипотолочныхсветильников',
  83 => 'аксессуарыдлябра',
  84 => 'аксессуарыдлянастольныхламп',
  85 => 'аксессуарыдляточечныхсветильников',
  86 => 'аксессуарыдляспотов',
  87 => 'аксессуарыдляуличныхсветильников',
  88 => 'аксессуарыдляспециализированныхсветильников',
  89 => 'средствадляочистки',
  90 => 'аксессуарыдляторшеров',
  91 => 'светодиодныелампы',
  92 => 'галогенныелампы',
  93 => 'лампынакаливания',
  94 => 'энергосберегающиелампы',
  95 => 'специализированныелампы',
  96 => 'светодиодныеленты',
  97 => 'управлениесветодиоднымилентами',
  98 => 'блокипитания',
  99 => 'профилидлялент',
  100 => 'комплектующиедлялент',
  101 => 'комплектующиедляпрофилей',
  102 => 'готовыекомплекты',
  103 => 'розетки',
  105 => 'выключателипереключатели',
  106 => 'рамкиисуппорты',
  107 => 'лицевыепанелиизаглушки',
  108 => 'терморегуляторы',
  109 => 'реле',
  110 => 'таймеры',
  111 => 'звонки',
  112 => 'удлинителиисетевыефильтры',
  113 => 'кабелииизоляторы',
  114 => 'патроны',
  115 => 'оборудованиезащитыикоммутации',
  116 => 'разветвителиипереходники',
  117 => 'монтажныекоробки',
  118 => 'электромонтажныекомплектующие',
  119 => 'клеммы',
  120 => 'акустическиесистемы',
  121 => 'кондиционерыивентиляция',
  122 => 'датчики',
  123 => 'шинопровод',
  124 => 'столы',
  125 => 'стулья',
  126 => 'мягкаямебель',
  127 => 'стеллажи',
  128 => 'комодытумбы',
  'аварийныесветильники' => 50,
  'аксессуарыдлябра' => 83,
  'аксессуарыдлялюстр' => 81,
  'аксессуарыдлянастольныхламп' => 84,
  'аксессуарыдляподвесныхипотолочныхсветильников' => 82,
  'аксессуарыдляспециализированныхсветильников' => 88,
  'аксессуарыдляспотов' => 86,
  'аксессуарыдляторшеров' => 90,
  'аксессуарыдляточечныхсветильников' => 85,
  'аксессуарыдляуличныхсветильников' => 87,
  'акустическиесистемы' => 120,
  'бактерицидныесветильники' => 43,
  'белтлайт' => 72,
  'блокипитания' => 98,
  'бра' => 10,
  'встраиваемыеспоты' => 19,
  'выключателипереключатели' => 105,
  'газонныесветильники' => 60,
  'галогенныелампы' => 92,
  'гирлянды' => 70,
  'готовыекомплекты' => 102,
  'готовыетрековыесистемы' => 29,
  'грунтовыесветильники' => 59,
  'датчики' => 122,
  'даунлайты' => 65,
  'декоративныенастольныелампы' => 11,
  'декоративныеподсветки' => 39,
  'детскиенастольныелампы' => 15,
  'дискошары' => 78,
  'дюралайт' => 73,
  'звонки' => 111,
  'интерьерныеукрашения' => 76,
  'кабелииизоляторы' => 113,
  'кабинетныенастольныелампы' => 13,
  'карданныесветильники' => 68,
  'каскадныелюстры' => 5,
  'клеммы' => 119,
  'кольцевыелампы' => 45,
  'комодытумбы' => 128,
  'комплектующиедлялент' => 100,
  'комплектующиедлямагнитныхтреков' => 35,
  'комплектующиедляпрофилей' => 101,
  'комплектующиедлятрековыхсистем' => 32,
  'кондиционерыивентиляция' => 121,
  'консольныесветильники' => 54,
  'лампынакаливания' => 93,
  'ландшафтныесветильники' => 52,
  'линейныесветильники' => 66,
  'лицевыепанелиизаглушки' => 107,
  'люстрывентиляторы' => 4,
  'люстрынаштанге' => 3,
  'магнитныетрековыесветильники' => 33,
  'магнитныешинопроводы' => 34,
  'мебельныесветильники' => 41,
  'модульныесветильники' => 67,
  'монтажныекоробки' => 117,
  'мягкаямебель' => 126,
  'накладныеспоты' => 20,
  'напольные' => 22,
  'настеннопотолочныесветильники' => 9,
  'настенныесветильники' => 8,
  'натреноге' => 21,
  'новогодниеподвесы' => 71,
  'ночники' => 14,
  'оборудованиезащитыикоммутации' => 115,
  'офисныенастольныелампы' => 12,
  'парковыесветильники' => 53,
  'патроны' => 114,
  'подвесныелюстры' => 2,
  'подводныесветильники' => 62,
  'подсветкидлявитриниполок' => 40,
  'подсветкидлязеркал' => 37,
  'подсветкидлякартин' => 36,
  'подсветкидлялестниц' => 38,
  'потолочныелюстры' => 1,
  'проекторы' => 77,
  'прожекторы' => 63,
  'промышленныесветильники' => 47,
  'профилидлялент' => 99,
  'разветвителиипереходники' => 116,
  'рамкиисуппорты' => 106,
  'реле' => 109,
  'розетки' => 103,
  'сабажуром' => 23,
  'светильникидлябаньисаун' => 48,
  'светильникидлярастений' => 42,
  'светильникижкх' => 49,
  'светильникислупой' => 44,
  'светодиодныедеревья' => 75,
  'светодиодныелампы' => 91,
  'светодиодныеленты' => 96,
  'светодиодныепанели' => 69,
  'светодиодныесвечииподсвечники' => 79,
  'светодиодныефигуры' => 74,
  'слампойдлячтения' => 24,
  'соляныелампы' => 46,
  'состоликом' => 26,
  'специализированныелампы' => 95,
  'средствадляочистки' => 89,
  'стеллажи' => 127,
  'столы' => 124,
  'стулья' => 125,
  'таймеры' => 110,
  'терморегуляторы' => 108,
  'точечныевстраиваемыесветильники' => 16,
  'точечныенакладныесветильники' => 17,
  'точечныеподвесныесветильники' => 18,
  'трековыесветильники' => 27,
  'трековыесистемынаремнях' => 31,
  'тросовыесистемы' => 30,
  'тротуарныесветильники' => 61,
  'удлинителиисетевыефильтры' => 112,
  'уличныенастенныесветильники' => 55,
  'уличныенастольныесветильники' => 56,
  'уличныеподвесныесветильники' => 58,
  'уличныепотолочныесветильники' => 57,
  'управлениесветодиоднымилентами' => 97,
  'фасадныесветильники' => 51,
  'фонарики' => 64,
  'хрустальные' => 25,
  'шинопровод' => 123,
  'шинопроводы' => 28,
  'электромонтажныекомплектующие' => 118,
  'энергосберегающиелампы' => 94,
) ;
$whiteList = array (
  0 => 
  array (
    0 => 0,
    1 => 1,
    2 => 2,
    3 => 3,
    4 => 4,
    5 => 5,
  ),
  5 => 
  array (
    0 => 0,
  ),
  6 => 
  array (
    0 => 0,
  ),
  7 => 
  array (
    0 => 0,
    1 => 8,
    2 => 9,
    3 => 10,
  ),
  10 => 
  array (
    0 => 0,
    1 => 11,
    2 => 12,
    3 => 13,
    4 => 14,
    5 => 15,
  ),
  15 => 
  array (
    0 => 0,
    1 => 16,
    2 => 17,
    3 => 18,
  ),
  18 => 
  array (
    0 => 0,
    1 => 19,
    2 => 20,
  ),
  20 => 
  array (
    0 => 0,
    1 => 21,
    2 => 22,
    3 => 23,
    4 => 24,
    5 => 25,
    6 => 26,
  ),
  26 => 
  array (
    0 => 0,
    1 => 27,
    2 => 28,
    3 => 29,
    4 => 30,
    5 => 31,
    6 => 32,
  ),
  32 => 
  array (
    0 => 0,
    1 => 33,
    2 => 34,
    3 => 35,
  ),
  35 => 
  array (
    0 => 0,
    1 => 36,
    2 => 37,
    3 => 38,
    4 => 39,
    5 => 40,
    6 => 41,
  ),
  41 => 
  array (
    0 => 0,
    1 => 42,
    2 => 43,
    3 => 44,
    4 => 45,
    5 => 46,
    6 => 47,
    7 => 48,
    8 => 49,
    9 => 50,
  ),
  50 => 
  array (
    0 => 0,
    1 => 51,
    2 => 52,
    3 => 53,
    4 => 54,
    5 => 55,
    6 => 56,
    7 => 57,
    8 => 58,
    9 => 59,
    10 => 60,
    11 => 61,
    12 => 62,
    13 => 63,
    14 => 64,
  ),
  64 => 
  array (
    0 => 0,
    1 => 65,
    2 => 66,
    3 => 67,
    4 => 68,
    5 => 69,
  ),
  69 => 
  array (
    0 => 0,
    1 => 70,
    2 => 71,
    3 => 72,
    4 => 73,
    5 => 74,
    6 => 75,
    7 => 76,
    8 => 77,
    9 => 78,
    10 => 79,
  ),
  79 => 
  array (
    0 => 0,
  ),
  80 => 
  array (
    0 => 0,
    1 => 81,
    2 => 82,
    3 => 83,
    4 => 84,
    5 => 85,
    6 => 86,
    7 => 87,
    8 => 88,
    9 => 89,
    10 => 90,
  ),
  90 => 
  array (
    0 => 0,
    1 => 91,
    2 => 92,
    3 => 93,
    4 => 94,
    5 => 95,
  ),
  95 => 
  array (
    0 => 0,
    1 => 96,
    2 => 97,
    3 => 98,
    4 => 99,
    5 => 100,
    6 => 101,
    7 => 102,
  ),
  102 => 
  array (
    0 => 0,
    1 => 103,
    2 => 105,
    3 => 106,
    4 => 107,
    5 => 108,
    6 => 109,
    7 => 110,
    8 => 111,
    9 => 112,
    10 => 113,
    11 => 114,
    12 => 115,
    13 => 116,
    14 => 117,
    15 => 118,
    16 => 119,
    17 => 120,
    18 => 121,
    19 => 122,
    20 => 123,
  ),
  123 => 
  array (
    0 => 0,
    1 => 124,
    2 => 125,
    3 => 126,
    4 => 127,
    5 => 128,
  ),
) ;
$data = array (
  0 => 
  array (
    1 => 
    array (
      'template' => 'Потолочная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Потолочная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    2 => 
    array (
      'template' => 'Подвесная люстра {$vendor} {$collection} {$article}',
      'singular' => 'Подвесная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    3 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    4 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Люстра на штанге',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
    5 => 
    array (
      'template' => 'Люстра на штанге {$vendor} {$collection} {$article}',
      'singular' => 'Каскадная люстра',
      'feature' => 
      array (
        0 => 'Люстры-вентиляторы',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  5 => 
  array (
    0 => 
    array (
      'template' => 'Подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подвесной светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => '',
      ),
    ),
  ),
  6 => 
  array (
    0 => 
    array (
      'template' => 'Потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Потолочный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  7 => 
  array (
    8 => 
    array (
      'template' => 'Настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    9 => 
    array (
      'template' => 'Настенно-потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Настенно-потолочный светильник',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    10 => 
    array (
      'template' => 'Бра {$vendor} {$collection} {$article}',
      'singular' => 'Бра с одним плафоном',
      'feature' => 
      array (
        0 => 'одинарные',
        1 => 'двойные',
        2 => 'тройные (можно оставить фильтр по цоколям)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  10 => 
  array (
    11 => 
    array (
      'template' => 'Декоративная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    12 => 
    array (
      'template' => 'Офисная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Офисная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    13 => 
    array (
      'template' => 'Кабинетная настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кабинетная настольная лампа',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    14 => 
    array (
      'template' => 'Ночник {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    15 => 
    array (
      'template' => 'Детская настольная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Ночник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  15 => 
  array (
    16 => 
    array (
      'template' => 'Точечный встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный встраиваемый светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    17 => 
    array (
      'template' => 'Точечный накладной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный накладной светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    18 => 
    array (
      'template' => 'Точечный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Точечный подвесной светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  18 => 
  array (
    19 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Точечный подвесной светильник',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    20 => 
    array (
      'template' => 'Спот {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  20 => 
  array (
    21 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    22 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    23 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Спот с тремя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    24 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с одним плафоном',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    25 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с одним плафоном',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    26 => 
    array (
      'template' => 'Торшер {$vendor} {$collection} {$article}',
      'singular' => 'Торшер с двумя и более плафонами',
      'feature' => 
      array (
        0 => 'на подставке',
        1 => 'на прищепке',
        2 => 'на струбцине',
        3 => 'детские',
        4 => 'многофункциональные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
  ),
  26 => 
  array (
    27 => 
    array (
      'template' => 'Трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Трековый светильник',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
      ),
    ),
    28 => 
    array (
      'template' => 'Шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    29 => 
    array (
      'template' => 'Готовая трековая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    30 => 
    array (
      'template' => 'Тросовая система {$vendor} {$collection} {$article}',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    31 => 
    array (
      'template' => 'В зависимости от товара, смотри лист с подсказками',
      'singular' => 'Готовая трековая система',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    32 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'трехфазные',
        1 => 'однофазные',
        2 => 'рейлинговые',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  32 => 
  array (
    33 => 
    array (
      'template' => 'Магнитный трековый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Магнитный трековый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    34 => 
    array (
      'template' => 'Магнитный шинопровод {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    35 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} **Наименование для блоков питания ARTELAMP Встраиваемых: Блок питания встраиваемый в трек ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article} Выносных: Блок питания ...V ...W для магнитной трековой системы {$vendor} Коллекция {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  35 => 
  array (
    36 => 
    array (
      'template' => 'Подсветка для картин {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для картин',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    37 => 
    array (
      'template' => 'Подсветка для зеркал {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для зеркал',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    38 => 
    array (
      'template' => 'Подсветка для лестниц {$vendor} {$collection} {$article}',
      'singular' => 'Подсветка для лестниц',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    39 => 
    array (
      'template' => 'Декоративная подсветка {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная подсветка',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    40 => 
    array (
      'template' => 'Подсветка для витрин {$vendor} {$collection} {$article}',
      'singular' => 'Декоративная подсветка',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    41 => 
    array (
      'template' => 'Мебельный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Мебельный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  41 => 
  array (
    42 => 
    array (
      'template' => 'Светильник для растений {$vendor} {$collection} {$article}',
      'singular' => 'Светильник для растений',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    43 => 
    array (
      'template' => 'Бактерицидный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Бактерицидный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    44 => 
    array (
      'template' => 'Светильник с лупой {$vendor} {$collection} {$article}',
      'singular' => 'Светильник с лупой',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    45 => 
    array (
      'template' => 'Кольцевая лампа {$vendor} {$collection} {$article}',
      'singular' => 'Кольцевая лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    46 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    47 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    48 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    49 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    50 => 
    array (
      'template' => 'Соляная лампа {$vendor} {$collection} {$article}',
      'singular' => 'Соляная лампа',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  50 => 
  array (
    51 => 
    array (
      'template' => 'Фасадный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Фасадный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    52 => 
    array (
      'template' => 'Ландшафтный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Ландшафтный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    53 => 
    array (
      'template' => 'Парковый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Парковый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    54 => 
    array (
      'template' => 'Консольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Консольный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    55 => 
    array (
      'template' => 'Уличный настенный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    56 => 
    array (
      'template' => 'Уличный настольный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный настенный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    57 => 
    array (
      'template' => 'Уличный потолочный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный потолочный светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    58 => 
    array (
      'template' => 'Уличный подвесной светильник {$vendor} {$collection} {$article}',
      'singular' => 'Уличный подвесной светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    59 => 
    array (
      'template' => 'Грунтовый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Грунтовый светильник',
      'feature' => 
      array (
        0 => 'магнитные',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    60 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Газонный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    61 => 
    array (
      'template' => 'Газонный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Тротуарный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    62 => 
    array (
      'template' => 'Подводный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Подводный светильник',
      'feature' => 
      array (
        0 => 'на солнечных батарейках',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    63 => 
    array (
      'template' => 'Прожектор {$vendor} {$collection} {$article}',
      'singular' => 'Прожектор',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
    64 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Фонарик',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
        1 => 'накладные',
        2 => 'подвесные',
      ),
    ),
  ),
  64 => 
  array (
    65 => 
    array (
      'template' => 'Встраиваемый светильник {$vendor} {$collection} {$article}',
      'singular' => 'Даунлайт',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    66 => 
    array (
      'template' => 'Линейный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Линейный',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    67 => 
    array (
      'template' => 'Модульный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Модульный светильник',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    68 => 
    array (
      'template' => 'Карданный светильник {$vendor} {$collection} {$article}',
      'singular' => 'Карданный светильник',
      'feature' => 
      array (
        0 => 'переносные',
        1 => 'на треноге',
      ),
      'installType' => 
      array (
        0 => 'подвесные',
        1 => 'накладные',
        2 => 'встраиваемые',
      ),
    ),
    69 => 
    array (
      'template' => 'Светодиодная панель {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодная панель',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  69 => 
  array (
    70 => 
    array (
      'template' => 'Гирлянда {$vendor} {$collection} {$article}',
      'singular' => 'Гирлянда',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    71 => 
    array (
      'template' => 'Новогодний подвес {$vendor} {$collection} {$article}',
      'singular' => 'Новогодний подвес',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    72 => 
    array (
      'template' => 'Белт-лайт {$vendor} {$collection} {$article}',
      'singular' => 'Белт-лайт',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    73 => 
    array (
      'template' => 'Дюралайт {$vendor} {$collection} {$article}',
      'singular' => 'Дюралайт',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    74 => 
    array (
      'template' => 'Световая фигура {$vendor} {$collection} {$article}',
      'singular' => 'Световая фигура',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    75 => 
    array (
      'template' => 'Светодиодное дерево {$vendor} {$collection} {$article}',
      'singular' => 'Светодиодное дерево',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    76 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Интерьерные украшения',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    77 => 
    array (
      'template' => 'Проектор {$vendor} {$collection} {$article}',
      'singular' => 'Проектор',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    78 => 
    array (
      'template' => 'Диско-шар {$vendor} {$collection} {$article}',
      'singular' => 'Диско-шар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    79 => 
    array (
      'template' => 'Свеча/подсвечник {$vendor} {$collection} {$article}',
      'singular' => 'Свеча',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  79 => 
  array (
    0 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Свеча',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  80 => 
  array (
    81 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    82 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    83 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    84 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    85 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    86 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    87 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    88 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    89 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    90 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Аксессуар',
      'feature' => 
      array (
        0 => 'Для потолков армстронг',
        1 => 'Для потолков грильято',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  90 => 
  array (
    91 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Светодиодная лампа',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    92 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Галогенная лампа',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    93 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    94 => 
    array (
      'template' => 'Тип лампы {$vendor} {$collection} Форма лампы/Колбы Мощность лампы lm Цветовая температура K Цоколь Артикул',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    95 => 
    array (
      'template' => 'Тип лампы _web {$vendor} {$collection} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'шар',
        1 => 'свеча',
        2 => 'свеча на ветру',
        3 => 'груша',
        4 => 'фигурные',
        5 => 'кукуруза',
        6 => 'таблетка',
        7 => 'колба',
        8 => 'софит',
        9 => 'рефлектор',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
  ),
  95 => 
  array (
    96 => 
    array (
      'template' => 'Светодиодная лента/Гибкий неон {$collection}(если есть) напряжение V цветовая температура К (в случае, если значение текстовое, то цветовая температура_web) мощность W/m метраж {$vendor} {$article}',
      'singular' => 'Лампа накаливания',
      'feature' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    97 => 
    array (
      'template' => 'Светодиодная лента/Гибкий неон {$collection}(если есть) напряжение V цветовая температура К (в случае, если значение текстовое, то цветовая температура_web) мощность W/m метраж {$vendor} {$article}',
      'singular' => 'Комплектующая',
      'feature' => 
      array (
        0 => 'для закарнизной подвестки',
        1 => 'подсветка для кухни',
        2 => 'подсветка для ванной комнаты',
        3 => 'мебельная подсветка',
        4 => 'уличная подсветка',
        5 => 'праздничная подсветка',
        6 => 'для влажных сред (сауны',
        7 => 'бассейна)',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    98 => 
    array (
      'template' => 'Светодиодная лента/Гибкий неон {$collection}(если есть) напряжение V цветовая температура К (в случае, если значение текстовое, то цветовая температура_web) мощность W/m метраж {$vendor} {$article}',
      'singular' => 'Блок питания',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'встраиваемые',
      ),
    ),
    99 => 
    array (
      'template' => 'Профиль для лент ',
      'singular' => 'Профиль для лент',
      'feature' => 
      array (
        0 => 'вольтаж',
        1 => 'мощность',
        2 => 'IP',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    100 => 
    array (
      'template' => 'Запчасть для лент',
      'singular' => 'Запчасть для лент',
      'feature' => 
      array (
        0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    101 => 
    array (
      'template' => 'Запчасть для профилей',
      'singular' => 'Запчасть для профилей',
      'feature' => 
      array (
        0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
    102 => 
    array (
      'template' => 'Готовый комплект ',
      'singular' => 'Готовый комплект',
      'feature' => 
      array (
        0 => 'Если неслоколько штук пишем - Комплект ... (кол-во шт)',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'подвесные',
      ),
    ),
  ),
  102 => 
  array (
    103 => 
    array (
      'template' => 'Розетка Тип розетки IP {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'со шторками',
        1 => 'с крышкой',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
        2 => 'переносные',
        3 => 'выдвижные',
      ),
    ),
    105 => 
    array (
      'template' => '{$osobennost} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    106 => 
    array (
      'template' => 'Рамка кол-во постов {$vendor} {$collection} {$article}',
      'singular' => 'Рамка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    107 => 
    array (
      'template' => '{$osobennost} для какого товара {$vendor} {$collection} {$article}',
      'singular' => 'Панель',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    108 => 
    array (
      'template' => 'Терморегулятор {$article}',
      'singular' => 'Терморегулятор',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    109 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Реле wifi',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    110 => 
    array (
      'template' => 'Таймер {$vendor} {$collection} {$article}',
      'singular' => 'Таймер',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    111 => 
    array (
      'template' => 'Звонок {$vendor} {$collection} {$article}',
      'singular' => 'Звонок',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    112 => 
    array (
      'template' => '{$osobennost} кол-во постов {$vendor} {$collection} {$article}',
      'singular' => 'Розетка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    113 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Кабель',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    114 => 
    array (
      'template' => 'Патрон {$vendor} {$collection} {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    115 => 
    array (
      'template' => 'Патрон {$vendor} {$collection} {$article}',
      'singular' => 'Патрон',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    116 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article}',
      'singular' => 'Разветвитель',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    117 => 
    array (
      'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    118 => 
    array (
      'template' => 'Монтажная коробка {$vendor} {$collection} {$article}',
      'singular' => 'Распаячная коробка',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    119 => 
    array (
      'template' => 'Клемма {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    120 => 
    array (
      'template' => 'Наименование поставщика {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    121 => 
    array (
      'template' => 'Наименование поставщика {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    122 => 
    array (
      'template' => 'Особенность {$vendor} {$collection} {$article}',
      'singular' => 'Клемма',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    123 => 
    array (
      'template' => 'Шинопровод для розеток {$vendor} {$collection} {$article}',
      'singular' => 'Шинопровод для розеток',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
  ),
  123 => 
  array (
    124 => 
    array (
      'template' => 'Стол {$article}',
      'singular' => 'Стол',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    125 => 
    array (
      'template' => 'Стул {$article}',
      'singular' => 'Стул',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    126 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Мебель',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    127 => 
    array (
      'template' => 'Стеллаж {$vendor} {$collection} {$article}',
      'singular' => 'Стеллаж',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
    128 => 
    array (
      'template' => '{$osobennost} {$vendor} {$collection} {$article} ',
      'singular' => 'Комод',
      'feature' => 
      array (
        0 => 'сенсорные',
        1 => 'клавишные (одноклавишные',
        2 => 'двухклавишные',
        3 => 'трехклавишные)',
        4 => 'кнопочные',
        5 => 'веревочные',
        6 => 'повортные',
        7 => 'карточные',
      ),
      'installType' => 
      array (
        0 => 'накладные',
        1 => 'встраиваемые',
      ),
    ),
  ),
) ;
$Ca = array (
  0 => 'Люстры',
  5 => 'Подвесные светильники',
  6 => 'Потолочные светильники',
  7 => 'Настенные светильники и бра',
  10 => 'Настольные лампы и ночники',
  15 => 'Точечные светильники',
  18 => 'Споты',
  20 => 'Торшеры',
  26 => 'Трековые системы',
  32 => 'Магнитные трековые системы',
  35 => 'Подсветки',
  41 => 'Специализированные светильники',
  50 => 'Уличное освещение',
  64 => 'Офисное освещение',
  69 => 'Праздничное освещение',
  79 => 'Управление светом',
  80 => 'Аксессуары',
  90 => 'Лампы',
  95 => 'Светодиодные ленты и комплектующие',
  102 => 'Электроустановочные изделия',
  123 => 'Мебель',
) ;
$SubCa = array (
  0 => '',
  1 => 'Потолочные люстры',
  2 => 'Подвесные люстры',
  3 => 'Люстры на штанге',
  4 => 'Люстры-вентиляторы',
  5 => 'Каскадные люстры',
  8 => 'Настенные светильники',
  9 => 'Настенно-потолочные светильники',
  10 => 'Бра',
  11 => 'Декоративные настольные лампы',
  12 => 'Офисные настольные лампы',
  13 => 'Кабинетные настольные лампы',
  14 => 'Ночники',
  15 => 'Детские настольные лампы',
  16 => 'Точечные встраиваемые светильники',
  17 => 'Точечные накладные светильники',
  18 => 'Точечные подвесные светильники',
  19 => 'Встраиваемые споты',
  20 => 'Накладные споты',
  21 => 'На треноге',
  22 => 'Напольные',
  23 => 'С абажуром',
  24 => 'С лампой для чтения',
  25 => 'Хрустальные',
  26 => 'Со столиком',
  27 => 'Трековые светильники',
  28 => 'Шинопроводы',
  29 => 'Готовые трековые системы',
  30 => 'Тросовые системы',
  31 => 'Трековые системы на ремнях',
  32 => 'Комплектующие для трековых систем',
  33 => 'Магнитные трековые светильники',
  34 => 'Магнитные шинопроводы',
  35 => 'Комплектующие для магнитных треков',
  36 => 'Подсветки для картин',
  37 => 'Подсветки для зеркал',
  38 => 'Подсветки для лестниц',
  39 => 'Декоративные подсветки',
  40 => 'Подсветки для витрин и полок',
  41 => 'Мебельные светильники',
  42 => 'Светильники для растений',
  43 => 'Бактерицидные светильники',
  44 => 'Светильники с лупой',
  45 => 'Кольцевые лампы',
  46 => 'Соляные лампы',
  47 => 'Промышленные светильники',
  48 => 'Светильники для бань и саун',
  49 => 'Светильники ЖКХ',
  50 => 'Аварийные светильники',
  51 => 'Фасадные светильники',
  52 => 'Ландшафтные светильники',
  53 => 'Парковые светильники',
  54 => 'Консольные светильники',
  55 => 'Уличные настенные светильники',
  56 => 'Уличные настольные светильники',
  57 => 'Уличные потолочные светильники',
  58 => 'Уличные подвесные светильники',
  59 => 'Грунтовые светильники',
  60 => 'Газонные светильники',
  61 => 'Тротуарные светильники',
  62 => 'Подводные светильники',
  63 => 'Прожекторы',
  64 => 'Фонарики',
  65 => 'Даунлайты',
  66 => 'Линейные светильники',
  67 => 'Модульные светильники',
  68 => 'Карданные светильники',
  69 => 'Светодиодные панели',
  70 => 'Гирлянды',
  71 => 'Новогодние подвесы',
  72 => 'Белт-лайт',
  73 => 'Дюралайт',
  74 => 'Светодиодные фигуры',
  75 => 'Светодиодные деревья ',
  76 => 'Интерьерные украшения',
  77 => 'Проекторы',
  78 => 'Диско-шары',
  79 => 'Светодиодные свечи и подсвечники',
  81 => 'Аксессуары для люстр',
  82 => 'Аксессуары для подвесных и потолочных светильников',
  83 => 'Аксессуары для бра',
  84 => 'Аксессуары для настольных ламп',
  85 => 'Аксессуары для точечных светильников',
  86 => 'Аксессуары для спотов',
  87 => 'Аксессуары для уличных светильников',
  88 => 'Аксессуары для специализированных светильников',
  89 => 'Средства для очистки',
  90 => 'Аксессуары для торшеров',
  91 => 'Светодиодные лампы',
  92 => 'Галогенные лампы',
  93 => 'Лампы накаливания',
  94 => 'Энергосберегающие лампы',
  95 => 'Специализированные лампы',
  96 => 'Светодиодные ленты',
  97 => 'Управление светодиодными лентами',
  98 => 'Блоки питания',
  99 => 'Профили для лент',
  100 => 'Комплектующие для лент',
  101 => 'Комплектующие для профилей',
  102 => 'Готовые комплекты',
  103 => 'Розетки',
  105 => 'Выключатели, переключатели',
  106 => 'Рамки и суппорты',
  107 => 'Лицевые панели и заглушки',
  108 => 'Терморегуляторы',
  109 => 'Реле',
  110 => 'Таймеры',
  111 => 'Звонки',
  112 => 'Удлинители и сетевые фильтры',
  113 => 'Кабели и изоляторы',
  114 => 'Патроны',
  115 => 'Оборудование защиты и коммутации',
  116 => 'Разветвители и переходники',
  117 => 'Монтажные коробки',
  118 => 'Электромонтажные комплектующие',
  119 => 'Клеммы',
  120 => 'Акустические системы',
  121 => 'Кондиционеры и вентиляция',
  122 => 'Датчики',
  123 => 'Шинопровод',
  124 => 'Столы',
  125 => 'Стулья',
  126 => 'Мягкая мебель',
  127 => 'Стеллажи',
  128 => 'Комоды, тумбы',
) ;
return [
'categories'=> $categories,
'subCategories'=> $subCategories,
'whiteList'=> $whiteList,
'data'=> $data,
'originalsCategories'=> $Ca,
'originalsSubCategories'=> $SubCa,
];